
<!DOCTYPE html>
<html lang="en" class="loading">
<head>
    <meta charset="UTF-8" />
    <meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
    <meta name="viewport" content="width=device-width, minimum-scale=1.0, maximum-scale=1.0, user-scalable=no">
    <title>集成学习 - Xuhui</title>
    <meta name="apple-mobile-web-app-capable" content="yes" />
    <meta name="apple-mobile-web-app-status-bar-style" content="black-translucent">
    <meta name="google" content="notranslate" />
    <meta name="keywords" content="Fechin,"> 
    <meta name="description" content="&amp;#x96C6;&amp;#x6210;&amp;#x5B66;&amp;#x4E60;
Bagging
&amp;#x539F;&amp;#x7406;bagging&amp;#x7684;&amp;#x4E2A;&amp;#x4F53;&amp;#x5F31;&amp;#x,"> 
    <meta name="author" content="Xuhui"> 
    <link rel="alternative" href="atom.xml" title="Xuhui" type="application/atom+xml"> 
    <link rel="icon" href="/img/logo.jpg"> 
    
<link rel="stylesheet" href="//cdn.jsdelivr.net/npm/gitalk@1/dist/gitalk.css">

    
<link rel="stylesheet" href="/css/diaspora.css">

	<script async src="//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    <script>
         (adsbygoogle = window.adsbygoogle || []).push({
              google_ad_client: "ca-pub-8691406134231910",
              enable_page_level_ads: true
         });
    </script>
    <script async custom-element="amp-auto-ads"
        src="https://cdn.ampproject.org/v0/amp-auto-ads-0.1.js">
    </script>
<meta name="generator" content="Hexo 4.2.0"></head>

<body class="loading">
    <span id="config-title" style="display:none">Xuhui</span>
    <div id="loader"></div>
    <div id="single">
    <div id="top" style="display: block;">
    <div class="bar" style="width: 0;"></div>
    <a class="iconfont icon-home image-icon" href="javascript:;" data-url="http://yoursite.com"></a>
    <div title="播放/暂停" class="iconfont icon-play"></div>
    <h3 class="subtitle">集成学习</h3>
    <div class="social">
        <div>
            <div class="share">
                <a title="获取二维码" class="iconfont icon-scan" href="javascript:;"></a>
            </div>
            <div id="qr"></div>
        </div>
    </div>
    <div class="scrollbar"></div>
</div>

    <div class="section">
        <div class="article">
    <div class='main'>
        <h1 class="title">集成学习</h1>
        <div class="stuff">
            <span>四月 05, 2020</span>
            
  <ul class="post-tags-list" itemprop="keywords"><li class="post-tags-list-item"><a class="post-tags-list-link" href="/tags/%E9%9B%86%E6%88%90%E5%AD%A6%E4%B9%A0/" rel="tag">集成学习</a></li></ul>


        </div>
        <div class="content markdown">
            <h2 id="&#x96C6;&#x6210;&#x5B66;&#x4E60;"><a href="#&#x96C6;&#x6210;&#x5B66;&#x4E60;" class="headerlink" title="&#x96C6;&#x6210;&#x5B66;&#x4E60;"></a>&#x96C6;&#x6210;&#x5B66;&#x4E60;</h2><p><img src="/2020/04/05/%E9%9B%86%E6%88%90%E5%AD%A6%E4%B9%A0/1.png" alt="c114e16ab421e1e02e9077091ae04cf6.png"></p>
<h3 id="Bagging"><a href="#Bagging" class="headerlink" title="Bagging"></a>Bagging</h3><hr>
<h5 id="&#x539F;&#x7406;"><a href="#&#x539F;&#x7406;" class="headerlink" title="&#x539F;&#x7406;"></a>&#x539F;&#x7406;</h5><p>bagging&#x7684;&#x4E2A;&#x4F53;&#x5F31;&#x5B66;&#x4E60;&#x5668;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x662F;&#x901A;&#x8FC7;&#x968F;&#x673A;&#x91C7;&#x6837;&#x5F97;&#x5230;&#x7684;&#x3002;&#x901A;&#x8FC7;T&#x6B21;&#x7684;&#x968F;&#x673A;&#x91C7;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230;T&#x4E2A;&#x91C7;&#x6837;&#x96C6;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;T&#x4E2A;&#x91C7;&#x6837;&#x96C6;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5206;&#x522B;&#x72EC;&#x7ACB;&#x7684;&#x8BAD;&#x7EC3;&#x51FA;T&#x4E2A;&#x5F31;&#x5B66;&#x4E60;&#x5668;&#xFF0C;&#x518D;&#x5BF9;&#x8FD9;T&#x4E2A;&#x5F31;&#x5B66;&#x4E60;&#x5668;&#x901A;&#x8FC7;&#x96C6;&#x5408;&#x7B56;&#x7565;&#x6765;&#x5F97;&#x5230;&#x6700;&#x7EC8;&#x7684;&#x5F3A;&#x5B66;&#x4E60;&#x5668;&#x3002;<br><img src="/2020/04/05/%E9%9B%86%E6%88%90%E5%AD%A6%E4%B9%A0/2.png" alt="35c73ab36ff3e097e3a21d1bba428568.png"></p>
<h5 id="&#x7279;&#x70B9;"><a href="#&#x7279;&#x70B9;" class="headerlink" title="&#x7279;&#x70B9;"></a>&#x7279;&#x70B9;</h5><ul>
<li>&#x4ECE;N&#x6837;&#x672C;&#x4E2D;&#x6709;&#x653E;&#x56DE;&#x7684;&#x91C7;&#x6837;N&#x4E2A;&#x6837;&#x672C;</li>
<li>&#x5BF9;&#x8FD9;N&#x4E2A;&#x6837;&#x672C;&#x5728;&#x5168;&#x5C5E;&#x6027;&#x4E0A;&#x5EFA;&#x7ACB;&#x5206;&#x7C7B;&#x5668;(CART,SVM)</li>
<li>&#x91CD;&#x590D;&#x4E0A;&#x9762;&#x7684;&#x6B65;&#x9AA4;&#xFF0C;&#x5EFA;&#x7ACB;m&#x4E2A;&#x5206;&#x7C7B;&#x5668;</li>
<li>&#x9884;&#x6D4B;&#x7684;&#x65F6;&#x5019;&#x4F7F;&#x7528;&#x6295;&#x7968;&#xFF08;&#x5206;&#x7C7B;&#xFF09;&#x6216;&#x5E73;&#x5747;&#xFF08;&#x56DE;&#x5F52;&#xFF09;&#x7684;&#x65B9;&#x6CD5;&#x5F97;&#x5230;&#x7ED3;&#x679C;<h5 id="&#x968F;&#x673A;&#x68EE;&#x6797;&#xFF08;&#x5178;&#x578B;&#xFF09;"><a href="#&#x968F;&#x673A;&#x68EE;&#x6797;&#xFF08;&#x5178;&#x578B;&#xFF09;" class="headerlink" title="&#x968F;&#x673A;&#x68EE;&#x6797;&#xFF08;&#x5178;&#x578B;&#xFF09;"></a>&#x968F;&#x673A;&#x68EE;&#x6797;&#xFF08;&#x5178;&#x578B;&#xFF09;</h5>&#x968F;&#x673A;&#x68EE;&#x6797;&#x662F;bagging&#x7684;&#x4E00;&#x4E2A;&#x7279;&#x5316;&#x8FDB;&#x9636;&#x7248;&#xFF0C;&#x6240;&#x8C13;&#x7684;&#x7279;&#x5316;&#x662F;&#x56E0;&#x4E3A;&#x968F;&#x673A;&#x68EE;&#x6797;&#x7684;&#x5F31;&#x5B66;&#x4E60;&#x5668;&#x90FD;&#x662F;&#x51B3;&#x7B56;&#x6811;&#x3002;&#x6240;&#x8C13;&#x7684;&#x8FDB;&#x9636;&#x662F;&#x968F;&#x673A;&#x68EE;&#x6797;&#x5728;bagging&#x7684;&#x6837;&#x672C;&#x968F;&#x673A;&#x91C7;&#x6837;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x53C8;&#x52A0;&#x4E0A;&#x4E86;&#x7279;&#x5F81;&#x7684;&#x968F;&#x673A;&#x9009;&#x62E9;&#xFF0C;&#x5176;&#x57FA;&#x672C;&#x601D;&#x60F3;&#x6CA1;&#x6709;&#x8131;&#x79BB;bagging&#x7684;&#x8303;&#x7574;&#x3002;</li>
</ul>
<p>&#x8FC7;&#x7A0B;</p>
<ul>
<li>RF&#x4F7F;&#x7528;&#x4E86;CART&#x51B3;&#x7B56;&#x6811;&#x4F5C;&#x4E3A;&#x5F31;&#x5B66;&#x4E60;&#x5668;&#x3002;</li>
<li>RF&#x5BF9;&#x51B3;&#x7B56;&#x6811;&#x7684;&#x5EFA;&#x7ACB;&#x505A;&#x4E86;&#x6539;&#x8FDB;&#xFF0C;&#x5BF9;&#x4E8E;&#x666E;&#x901A;&#x7684;&#x51B3;&#x7B56;&#x6811;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5728;&#x8282;&#x70B9;&#x4E0A;&#x6240;&#x6709;&#x7684;n&#x4E2A;&#x6837;&#x672C;&#x7279;&#x5F81;&#x4E2D;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x6700;&#x4F18;&#x7684;&#x7279;&#x5F81;&#x6765;&#x505A;&#x51B3;&#x7B56;&#x6811;&#x7684;&#x5DE6;&#x53F3;&#x5B50;&#x6811;&#x5212;&#x5206;&#xFF0C;&#x4F46;&#x662F;RF&#x901A;&#x8FC7;&#x7684;&#x968F;&#x673A;&#x9009;&#x62E9;&#x8282;&#x70B9;&#x4E0A;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x6837;&#x672C;&#x7279;&#x5F81;&#xFF0C;&#x8FD9;&#x4E2A;&#x6570;&#x5B57;&#x5C0F;&#x4E8E;n&#xFF0C;&#x5047;&#x8BBE;&#x4E3A;m&#xFF0C;&#x7136;&#x540E;&#x5728;&#x8FD9;&#x4E9B;&#x968F;&#x673A;&#x9009;&#x62E9;&#x7684;m&#xFF08;&#x5C0F;&#x4E8E;n&#xFF09;&#x4E2A;&#x6837;&#x672C;&#x7279;&#x5F81;&#x4E2D;&#xFF0C;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x6700;&#x4F18;&#x7684;&#x7279;&#x5F81;&#x6765;&#x505A;&#x51B3;&#x7B56;&#x6811;&#x7684;&#x5DE6;&#x53F3;&#x5B50;&#x6811;&#x5212;&#x5206;&#x3002;&#x8FD9;&#x6837;&#x8FDB;&#x4E00;&#x6B65;&#x589E;&#x5F3A;&#x4E86;&#x6A21;&#x578B;&#x7684;&#x6CDB;&#x5316;&#x80FD;&#x529B;&#x3002;</li>
</ul>
<p>&#x53C2;&#x8003;&#xFF1A;<a href="https://www.cnblogs.com/pinard/p/6156009.html" target="_blank" rel="noopener">&#x5218;&#x5EFA;&#x5E73;&#x2013;&#x968F;&#x673A;&#x68EE;&#x6797;</a></p>
<h3 id="Boosting"><a href="#Boosting" class="headerlink" title="Boosting"></a>Boosting</h3><hr>
<h5 id="&#x539F;&#x7406;-1"><a href="#&#x539F;&#x7406;-1" class="headerlink" title="&#x539F;&#x7406;"></a>&#x539F;&#x7406;</h5><p>&#x9996;&#x5148;&#x4ECE;&#x8BAD;&#x7EC3;&#x96C6;&#x7528;&#x521D;&#x59CB;&#x6743;&#x91CD;&#x8BAD;&#x7EC3;&#x51FA;&#x4E00;&#x4E2A;&#x5F31;&#x5B66;&#x4E60;&#x5668;1&#xFF0C;&#x6839;&#x636E;&#x5F31;&#x5B66;&#x4E60;&#x7684;&#x5B66;&#x4E60;&#x8BEF;&#x5DEE;&#x7387;&#x8868;&#x73B0;&#x6765;&#x66F4;&#x65B0;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x7684;&#x6743;&#x91CD;&#xFF0C;&#x4F7F;&#x5F97;&#x4E4B;&#x524D;&#x5F31;&#x5B66;&#x4E60;&#x5668;1&#x5B66;&#x4E60;&#x8BEF;&#x5DEE;&#x7387;&#x9AD8;&#x7684;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x70B9;&#x7684;&#x6743;&#x91CD;&#x53D8;&#x9AD8;&#xFF0C;&#x4F7F;&#x5F97;&#x8FD9;&#x4E9B;&#x8BEF;&#x5DEE;&#x7387;&#x9AD8;&#x7684;&#x70B9;&#x5728;&#x540E;&#x9762;&#x7684;&#x5F31;&#x5B66;&#x4E60;&#x5668;2&#x4E2D;&#x5F97;&#x5230;&#x66F4;&#x591A;&#x7684;&#x91CD;&#x89C6;&#x3002;&#x7136;&#x540E;&#x57FA;&#x4E8E;&#x8C03;&#x6574;&#x6743;&#x91CD;&#x540E;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x6765;&#x8BAD;&#x7EC3;&#x5F31;&#x5B66;&#x4E60;&#x5668;2.&#xFF0C;&#x5982;&#x6B64;&#x91CD;&#x590D;&#x8FDB;&#x884C;&#xFF0C;&#x76F4;&#x5230;&#x5F31;&#x5B66;&#x4E60;&#x5668;&#x6570;&#x8FBE;&#x5230;&#x4E8B;&#x5148;&#x6307;&#x5B9A;&#x7684;&#x6570;&#x76EE;T&#xFF0C;&#x6700;&#x7EC8;&#x5C06;&#x8FD9;T&#x4E2A;&#x5F31;&#x5B66;&#x4E60;&#x5668;&#x901A;&#x8FC7;&#x96C6;&#x5408;&#x7B56;&#x7565;&#x8FDB;&#x884C;&#x6574;&#x5408;&#xFF0C;&#x5F97;&#x5230;&#x6700;&#x7EC8;&#x7684;&#x5F3A;&#x5B66;&#x4E60;&#x5668;&#x3002;<br><img src="/2020/04/05/%E9%9B%86%E6%88%90%E5%AD%A6%E4%B9%A0/3.png" alt="2203bf49056a082a41a80c37d20ed33e.png"></p>
<h5 id="&#x7279;&#x70B9;-1"><a href="#&#x7279;&#x70B9;-1" class="headerlink" title="&#x7279;&#x70B9;"></a>&#x7279;&#x70B9;</h5><ul>
<li>&#x5728;&#x8BAD;&#x7EC3;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x7ED9;&#x6837;&#x672C;&#x52A0;&#x4E00;&#x4E2A;&#x6743;&#x91CD;&#xFF0C;&#x7136;&#x540E;&#x4F7F;loss function&#x5C3D;&#x91CF;&#x53BB;&#x8003;&#x8651;&#x90A3;&#x4E9B;&#x5206;&#x9519;&#x7C7B;&#x7684;&#x6837;&#x672C;&#xFF08;&#x6BD4;&#x5982;&#x7ED9;&#x5206;&#x9519;&#x7C7B;&#x7684;&#x6837;&#x672C;&#x7684;&#x6743;&#x91CD;&#x503C;&#x52A0;&#x5927;&#xFF09;</li>
</ul>
<h4 id="Adaboost"><a href="#Adaboost" class="headerlink" title="Adaboost"></a>Adaboost</h4><hr>
<p>&#x7528;&#x5230;&#x7684;&#x524D;&#x5411;&#x5206;&#x6B65;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x662F;&#x901A;&#x8FC7;&#x4E00;&#x8F6E;&#x8F6E;&#x7684;&#x5F31;&#x5B66;&#x4E60;&#x5668;&#x5B66;&#x4E60;&#xFF0C;&#x5229;&#x7528;&#x524D;&#x4E00;&#x4E2A;&#x5F3A;&#x5B66;&#x4E60;&#x5668;&#x7684;&#x7ED3;&#x679C;&#x548C;&#x5F53;&#x524D;&#x5F31;&#x5B66;&#x4E60;&#x5668;&#x6765;&#x66F4;&#x65B0;&#x5F53;&#x524D;&#x7684;&#x5F3A;&#x5B66;&#x4E60;&#x5668;&#x7684;&#x6A21;&#x578B;&#x3002;&#x7406;&#x8BBA;&#x4E0A;&#x4EFB;&#x4F55;&#x5B66;&#x4E60;&#x5668;&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;Adaboost.&#x4F46;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x4F7F;&#x7528;&#x6700;&#x5E7F;&#x6CDB;&#x7684;Adaboost&#x5F31;&#x5B66;&#x4E60;&#x5668;&#x662F;&#x51B3;&#x7B56;&#x6811;&#x548C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;&#x5BF9;&#x4E8E;&#x51B3;&#x7B56;&#x6811;&#xFF0C;Adaboost&#x5206;&#x7C7B;&#x7528;&#x4E86;CART&#x5206;&#x7C7B;&#x6811;&#xFF0C;&#x800C;Adaboost&#x56DE;&#x5F52;&#x7528;&#x4E86;CART&#x56DE;&#x5F52;&#x6811;&#x3002;</p>
<p>Adaboost&#x7684;&#x4E3B;&#x8981;&#x4F18;&#x70B9;&#x6709;&#xFF1A;&#x3000;&#x3000;&#x3000;&#x3000;</p>
<ul>
<li>Adaboost&#x4F5C;&#x4E3A;&#x5206;&#x7C7B;&#x5668;&#x65F6;&#xFF0C;&#x5206;&#x7C7B;&#x7CBE;&#x5EA6;&#x5F88;&#x9AD8;&#x3000;&#x3000;&#x3000;&#x3000;</li>
<li>&#x5728;Adaboost&#x7684;&#x6846;&#x67B6;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5404;&#x79CD;&#x56DE;&#x5F52;&#x5206;&#x7C7B;&#x6A21;&#x578B;&#x6765;&#x6784;&#x5EFA;&#x5F31;&#x5B66;&#x4E60;&#x5668;&#xFF0C;&#x975E;&#x5E38;&#x7075;&#x6D3B;&#x3002;&#x3000;&#x3000;&#x3000;&#x3000;</li>
<li>&#x4F5C;&#x4E3A;&#x7B80;&#x5355;&#x7684;&#x4E8C;&#x5143;&#x5206;&#x7C7B;&#x5668;&#x65F6;&#xFF0C;&#x6784;&#x9020;&#x7B80;&#x5355;&#xFF0C;&#x7ED3;&#x679C;&#x53EF;&#x7406;&#x89E3;&#x3002;&#x3000;&#x3000;&#x3000;&#x3000;</li>
<li>&#x4E0D;&#x5BB9;&#x6613;&#x53D1;&#x751F;&#x8FC7;&#x62DF;&#x5408;</li>
</ul>
<p>Adaboost&#x7684;&#x4E3B;&#x8981;&#x7F3A;&#x70B9;&#x6709;&#xFF1A;&#x3000;&#x3000;&#x3000;&#x3000;</p>
<ul>
<li>&#x5BF9;&#x5F02;&#x5E38;&#x6837;&#x672C;&#x654F;&#x611F;&#xFF0C;&#x5F02;&#x5E38;&#x6837;&#x672C;&#x5728;&#x8FED;&#x4EE3;&#x4E2D;&#x53EF;&#x80FD;&#x4F1A;&#x83B7;&#x5F97;&#x8F83;&#x9AD8;&#x7684;&#x6743;&#x91CD;&#xFF0C;&#x5F71;&#x54CD;&#x6700;&#x7EC8;&#x7684;&#x5F3A;&#x5B66;&#x4E60;&#x5668;&#x7684;&#x9884;&#x6D4B;&#x51C6;&#x786E;&#x6027;&#x3002;</li>
</ul>
<p>&#x53C2;&#x8003;&#xFF1A;<a href="https://www.cnblogs.com/pinard/p/6133937.html" target="_blank" rel="noopener">&#x5218;&#x5EFA;&#x5E73;&#x2013;Adaboost</a></p>
<h4 id="GBDT"><a href="#GBDT" class="headerlink" title="GBDT"></a>GBDT</h4><hr>
<h5 id="&#x539F;&#x7406;-2"><a href="#&#x539F;&#x7406;-2" class="headerlink" title="&#x539F;&#x7406;"></a>&#x539F;&#x7406;</h5><p>&#x53C2;&#x8003;&#xFF1A;<a href="https://zhuanlan.zhihu.com/p/29765582" target="_blank" rel="noopener">&#x63A8;&#x5BFC;&#x8FC7;&#x7A0B;</a></p>
<h5 id="GBDT&#x548C;Adaboost&#x4E0D;&#x540C;&#x4E4B;&#x5904;"><a href="#GBDT&#x548C;Adaboost&#x4E0D;&#x540C;&#x4E4B;&#x5904;" class="headerlink" title="GBDT&#x548C;Adaboost&#x4E0D;&#x540C;&#x4E4B;&#x5904;"></a>GBDT&#x548C;Adaboost&#x4E0D;&#x540C;&#x4E4B;&#x5904;</h5><p>GBDT&#x5206;&#x7C7B;&#x548C;&#x56DE;&#x5F52;&#x65F6;&#x7684;&#x57FA;&#x5B66;&#x4E60;&#x5668;&#x90FD;&#x662F;CART&#x56DE;&#x5F52;&#x6811;&#xFF0C;&#x56E0;&#x4E3A;&#x662F;&#x62DF;&#x5408;&#x6B8B;&#x5DEE;&#x7684;&#x3002;GBDT&#x548C;Adaboost&#x4E00;&#x6837;&#x53EF;&#x4EE5;&#x7528;&#x524D;&#x5411;&#x5206;&#x5E03;&#x7B97;&#x6CD5;&#x6765;&#x63CF;&#x8FF0;&#xFF0C;&#x4E0D;&#x540C;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#xFF1A;</p>
<ul>
<li>Adaboost&#x7B97;&#x6CD5;&#x6BCF;&#x6B21;&#x62DF;&#x5408;&#x57FA;&#x5B66;&#x4E60;&#x5668;&#x65F6;&#xFF0C;<u>&#x8F93;&#x5165;&#x7684;&#x6837;&#x672C;&#x6570;&#x636E;&#x662F;</u>&#x4E0D;&#x4E00;&#x6837;&#x7684;&#xFF08;&#x6BCF;&#x4E00;&#x8F6E;&#x8FED;&#x4EE3;&#x65F6;&#x7684;&#x6837;&#x672C;&#x6743;&#x91CD;&#x4E0D;&#x4E00;&#x81F4;&#xFF09;Adaboost&#x65E8;&#x5728;&#x91CD;&#x70B9;&#x5173;&#x6CE8;&#x4E0A;&#x4E00;&#x8F6E;&#x5206;&#x7C7B;&#x9519;&#x8BEF;&#x7684;&#x6837;&#x672C;&#x3002;</li>
<li>GBDT&#x7B97;&#x6CD5;&#x5728;&#x6BCF;&#x4E00;&#x6B65;&#x8FED;&#x4EE3;&#x65F6;&#x662F;<u>&#x8F93;&#x51FA;&#x7684;&#x503C;&#x4E0D;&#x4E00;&#x6837;</u>&#xFF0C;&#x672C;&#x8F6E;&#x8981;&#x62DF;&#x5408;&#x7684;&#x8F93;&#x51FA;&#x503C;&#x662F;&#x4E4B;&#x524D;&#x7684;&#x52A0;&#x6CD5;&#x6A21;&#x578B;&#x7684;&#x9884;&#x6D4B;&#x503C;&#x548C;&#x771F;&#x5B9E;&#x503C;&#x7684;&#x5DEE;&#x503C;&#xFF08;&#x6A21;&#x578B;&#x7684;&#x6B8B;&#x5DEE;&#xFF0C;&#x4E5F;&#x79F0;&#x4E3A;&#x635F;&#x5931;&#xFF09;&#x3002;</li>
</ul>
<blockquote>
<p>&#x7528;&#x4E8E;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#x6765;&#x8BF4;&#x660E;GBDT&#xFF0C;&#x5047;&#x5982;&#x67D0;&#x4EBA;&#x7684;&#x5E74;&#x9F84;&#x4E3A;30&#x5C81;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x7528;20&#x5C81;&#x53BB;&#x62DF;&#x5408;&#xFF0C;&#x53D1;&#x73B0;&#x635F;&#x5931;&#x8FD8;&#x6709;10&#x5C81;&#xFF0C;&#x7B2C;&#x4E8C;&#x6B21;&#x7528;6&#x5C81;&#x53BB;&#x62DF;&#x5408;10&#x5C81;&#xFF0C;&#x53D1;&#x73B0;&#x635F;&#x5931;&#x8FD8;&#x6709;4&#x5C81;&#xFF0C;&#x7B2C;&#x4E09;&#x6B21;&#x7528;3&#x5C81;&#x53BB;&#x62DF;&#x5408;4&#x5C81;&#xFF0C;&#x4F9D;&#x6B21;&#x4E0B;&#x53BB;&#x76F4;&#x5230;&#x635F;&#x5931;&#x5728;&#x6211;&#x4EEC;&#x53EF;&#x63A5;&#x53D7;&#x8303;&#x56F4;&#x5185;&#x3002;</p>
</blockquote>
<h5 id="&#x603B;&#x7ED3;&#xFF1A;"><a href="#&#x603B;&#x7ED3;&#xFF1A;" class="headerlink" title="&#x603B;&#x7ED3;&#xFF1A;"></a>&#x603B;&#x7ED3;&#xFF1A;</h5><ul>
<li>AdaBoost&#x662F;&#x901A;&#x8FC7;&#x63D0;&#x5347;&#x9519;&#x5206;&#x6570;&#x636E;&#x70B9;&#x7684;&#x6743;&#x91CD;&#x6765;&#x5B9A;&#x4F4D;&#x6A21;&#x578B;&#x7684;&#x4E0D;&#x8DB3;&#xFF0C;&#x800C;Gradient Boosting&#x662F;&#x901A;&#x8FC7;&#x7B97;&#x68AF;&#x5EA6;&#xFF08;gradient&#xFF09;&#x6765;&#x5B9A;&#x4F4D;&#x6A21;&#x578B;&#x7684;&#x4E0D;&#x8DB3;&#x3002;&#x56E0;&#x6B64;&#x76F8;&#x6BD4;AdaBoost, Gradient Boosting&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x66F4;&#x591A;&#x79CD;&#x7C7B;&#x7684;&#x76EE;&#x6807;&#x51FD;&#x6570;&#xFF0C;&#x800C;&#x5F53;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x662F;&#x5747;&#x65B9;&#x8BEF;&#x5DEE;&#x65F6;&#xFF0C;&#x8BA1;&#x7B97;&#x635F;&#x5931;&#x51FD;&#x6570;&#x7684;&#x8D1F;&#x68AF;&#x5EA6;&#x503C;&#x5728;&#x5F53;&#x524D;&#x6A21;&#x578B;&#x7684;&#x503C;&#x5373;&#x4E3A;&#x6B8B;&#x5DEE;&#x3002;</li>
</ul>
<h4 id="XGBoost"><a href="#XGBoost" class="headerlink" title="XGBoost"></a>XGBoost</h4><hr>
<h5 id="&#x8BAD;&#x7EC3;&#x8BEF;&#x5DEE;"><a href="#&#x8BAD;&#x7EC3;&#x8BEF;&#x5DEE;" class="headerlink" title="&#x8BAD;&#x7EC3;&#x8BEF;&#x5DEE;"></a>&#x8BAD;&#x7EC3;&#x8BEF;&#x5DEE;</h5><p><strong>1&#x3001;XGBoost&#x4E0E;GBDT&#x6BD4;&#x8F83;&#x5927;&#x7684;&#x4E0D;&#x540C;&#x5C31;&#x662F;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x7684;&#x5B9A;&#x4E49;&#x3002;</strong></p>
<hr>
<p><img src="/2020/04/05/%E9%9B%86%E6%88%90%E5%AD%A6%E4%B9%A0/4.png" alt="db8423874bbaa7c0bfa3bf6c24eb5733.png"><br><strong>2&#x3001;XGBoost&#x7684;&#x6838;&#x5FC3;&#x7B97;&#x6CD5;&#x601D;&#x60F3;&#xFF1A;</strong></p>
<ul>
<li>&#x4E0D;&#x65AD;&#x5730;&#x6DFB;&#x52A0;&#x6811;&#xFF0C;&#x4E0D;&#x65AD;&#x5730;&#x8FDB;&#x884C;&#x7279;&#x5F81;&#x5206;&#x88C2;&#x6765;&#x751F;&#x957F;&#x4E00;&#x68F5;&#x6811;&#xFF0C;&#x6BCF;&#x6B21;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x6811;&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x5B66;&#x4E60;&#x4E00;&#x4E2A;&#x65B0;&#x51FD;&#x6570;f(x)&#xFF0C;&#x53BB;&#x62DF;&#x5408;&#x4E0A;&#x6B21;&#x9884;&#x6D4B;&#x7684;&#x6B8B;&#x5DEE;&#x3002;</li>
<li>&#x5F53;&#x6211;&#x4EEC;&#x8BAD;&#x7EC3;&#x5B8C;&#x6210;&#x5F97;&#x5230;k&#x68F5;&#x6811;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x9884;&#x6D4B;&#x4E00;&#x4E2A;&#x6837;&#x672C;&#x7684;&#x5206;&#x6570;&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x6839;&#x636E;&#x8FD9;&#x4E2A;&#x6837;&#x672C;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x5728;&#x6BCF;&#x68F5;&#x6811;&#x4E2D;&#x4F1A;&#x843D;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x4E00;&#x4E2A;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#xFF0C;&#x6BCF;&#x4E2A;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x5C31;&#x5BF9;&#x5E94;&#x4E00;&#x4E2A;&#x5206;&#x6570;&#x3002;</li>
<li>&#x6700;&#x540E;&#x53EA;&#x9700;&#x8981;&#x5C06;&#x6BCF;&#x68F5;&#x6811;&#x5BF9;&#x5E94;&#x7684;&#x5206;&#x6570;&#x52A0;&#x8D77;&#x6765;&#x5C31;&#x662F;&#x8BE5;&#x6837;&#x672C;&#x7684;&#x9884;&#x6D4B;&#x503C;&#x3002;</li>
</ul>
<p><img src="/2020/04/05/%E9%9B%86%E6%88%90%E5%AD%A6%E4%B9%A0/5.png" alt="0b0a0a67de2ca208b1ad20509ea148c3.png"></p>
<p>&#x6BCF;&#x4E00;&#x6B21;&#x8FED;&#x4EE3;&#xFF0C;&#x90FD;&#x5728;&#x73B0;&#x6709;&#x6811;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x589E;&#x52A0;&#x4E00;&#x68F5;&#x6811;f(x)&#xFF08;&#x6CE8;&#x610F;&#xFF1A;f(x)=L(y,y^(t-1))&#xFF09;&#x53BB;&#x62DF;&#x5408;&#x524D;&#x9762;&#x6811;&#x7684;&#x9884;&#x6D4B;&#x7ED3;&#x679C;&#x4E0E;&#x771F;&#x5B9E;&#x503C;&#x4E4B;&#x95F4;&#x7684;&#x6B8B;&#x5DEE;&#x3002;&#x52A0;&#x5165;&#x7684;f(x)&#x5982;&#x56FE;&#xFF08;&#x5E76;&#x628A;&#x5B83;&#x6CF0;&#x52D2;&#x5C55;&#x5F00;&#xFF09;&#xFF08;&#x6C42;&#x548C;&#x8868;&#x793A;n&#x4E2A;&#x6837;&#x672C;&#x7684;&#x8BEF;&#x5DEE;&#x4E4B;&#x548C;&#xFF09;&#xFF1A;<br><img src="/2020/04/05/%E9%9B%86%E6%88%90%E5%AD%A6%E4%B9%A0/6.png" alt="5ff5d12d1290076a952652d8ffa34b1e.png"><br>&#x56FE;&#x4E2D;&#x7EA2;&#x5708;&#x5373;&#x4E3A;&#x76EE;&#x6807;&#x635F;&#x5931;&#x51FD;&#x6570;&#xFF0C;&#x76EE;&#x7684;&#x8981;&#x8BA9;&#x5B83;&#x53D8;&#x5F97;&#x6700;&#x5C0F;&#x3002;<br>&#x5B9E;&#x8D28;&#x662F;&#x628A;&#x6837;&#x672C;&#x5206;&#x914D;&#x5230;&#x53F6;&#x5B50;&#x7ED3;&#x70B9;&#x4F1A;&#x5BF9;&#x5E94;&#x4E00;&#x4E2A;obj&#xFF0C;&#x4F18;&#x5316;&#x8FC7;&#x7A0B;&#x5C31;&#x662F;obj&#x4F18;&#x5316;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x5206;&#x88C2;&#x8282;&#x70B9;&#x5230;&#x53F6;&#x5B50;&#x4E0D;&#x540C;&#x7684;&#x7EC4;&#x5408;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x7EC4;&#x5408;&#x5BF9;&#x5E94;&#x4E0D;&#x540C;obj&#xFF08;&#x662F;&#x6307;&#x4E00;&#x4E2A;&#x6811;&#x4E00;&#x4E2A;&#x7EC4;&#x5408;&#x4E00;&#x4E2A;obj&#x5417;&#xFF1F;&#x5E94;&#x8BE5;&#x662F;&#xFF0C;&#x4ECE;obj&#x7684;&#x4E0A;&#x6807;&#x770B;&#x603B;&#x5171;&#x4F1A;&#x6709;t&#x4E2A;obj&#xFF09;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x4F18;&#x5316;&#x56F4;&#x7ED5;&#x8FD9;&#x4E2A;&#x601D;&#x60F3;&#x5C55;&#x5F00;&#x3002;</p>
<h5 id="&#x6B63;&#x5219;&#x5316;"><a href="#&#x6B63;&#x5219;&#x5316;" class="headerlink" title="&#x6B63;&#x5219;&#x5316;"></a>&#x6B63;&#x5219;&#x5316;</h5><p>XGBoost&#x5BF9;&#x6811;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x5305;&#x542B;&#x4E86;&#x4E24;&#x4E2A;&#x90E8;&#x5206;&#xFF1A;</p>
<ul>
<li>&#x662F;&#x6811;&#x91CC;&#x9762;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x7684;&#x4E2A;&#x6570;T</li>
<li>&#x6811;&#x4E0A;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x7684;&#x5F97;&#x5206;w&#x7684;L2&#x6A21;&#x5E73;&#x65B9;&#xFF08;&#x5BF9;w&#x8FDB;&#x884C;L2&#x6B63;&#x5219;&#x5316;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x9488;&#x5BF9;&#x6BCF;&#x4E2A;&#x53F6;&#x7ED3;&#x70B9;&#x7684;&#x5F97;&#x5206;&#x589E;&#x52A0;L2&#x5E73;&#x6ED1;&#xFF0C;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x8FC7;&#x62DF;&#x5408;&#xFF09;<br><img src="/2020/04/05/%E9%9B%86%E6%88%90%E5%AD%A6%E4%B9%A0/7.png" alt="2fe684e73353b789f6576d503ffbf072.png"><br>&#x6B63;&#x5219;&#x5316;&#x9879;&#x8868;&#x793A;&#x6811;&#x7684;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x503C;&#x8D8A;&#x5C0F;&#x590D;&#x6742;&#x5EA6;&#x8D8A;&#x4F4E;&#xFF0C;&#x6CDB;&#x5316;&#x80FD;&#x529B;&#x8D8A;&#x5F3A;&#x3002;</li>
</ul>
<h5 id="&#x6811;&#x7684;&#x5206;&#x7C7B;&#x70B9;&#x9009;&#x62E9;"><a href="#&#x6811;&#x7684;&#x5206;&#x7C7B;&#x70B9;&#x9009;&#x62E9;" class="headerlink" title="&#x6811;&#x7684;&#x5206;&#x7C7B;&#x70B9;&#x9009;&#x62E9;"></a>&#x6811;&#x7684;&#x5206;&#x7C7B;&#x70B9;&#x9009;&#x62E9;</h5><p>XGBoost&#x4F5C;&#x8005;&#x5728;&#x5176;&#x539F;&#x59CB;&#x8BBA;&#x6587;&#x4E2D;&#x7ED9;&#x51FA;&#x4E86;&#x4E00;&#x79CD;&#x5206;&#x88C2;&#x8282;&#x70B9;&#x7684;&#x65B9;&#x6CD5;&#xFF1A;&#x679A;&#x4E3E;&#x6240;&#x6709;&#x4E0D;&#x540C;&#x6811;&#x7ED3;&#x6784;&#x7684;<u>&#x8D2A;&#x5FC3;&#x6CD5;</u>&#x3002;</p>
<ul>
<li>&#x4E0D;&#x65AD;&#x5730;&#x679A;&#x4E3E;&#x4E0D;&#x540C;&#x6811;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x7136;&#x540E;&#x5229;&#x7528;&#x6253;&#x5206;&#x51FD;&#x6570;&#x6765;&#x5BFB;&#x627E;&#x51FA;&#x4E00;&#x4E2A;&#x6700;&#x4F18;&#x7ED3;&#x6784;&#x7684;&#x6811;&#xFF0C;&#x63A5;&#x7740;&#x52A0;&#x5165;&#x5230;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x4E0D;&#x65AD;&#x91CD;&#x590D;&#x8FD9;&#x6837;&#x7684;&#x64CD;&#x4F5C;&#x3002;</li>
<li>&#x6BCF;&#x6B21;&#x9009;&#x62E9;&#x4E00;&#x4E2A;feature&#x5206;&#x88C2;&#xFF0C;&#x8BA1;&#x7B97;loss function&#x6700;&#x5C0F;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x9009;&#x4E00;&#x4E2A;feature&#x5206;&#x88C2;&#xFF0C;&#x53C8;&#x5F97;&#x5230;&#x4E00;&#x4E2A;loss function&#x6700;&#x5C0F;&#x503C;&#xFF0C;&#x679A;&#x4E3E;&#x5B8C;&#x627E;&#x4E00;&#x4E2A;&#x6548;&#x679C;&#x6700;&#x597D;&#x7684;&#xFF0C;&#x628A;&#x6811;&#x7ED9;&#x5206;&#x88C2;&#xFF0C;&#x5C31;&#x5F97;&#x5230;&#x4E86;&#x5C0F;&#x6811;&#x82D7;&#x3002;</li>
<li>&#x6BCF;&#x6B21;&#x8FDB;&#x884C;&#x5206;&#x88C2;&#x5C1D;&#x8BD5;&#x90FD;&#x8981;&#x904D;&#x5386;&#x4E00;&#x904D;&#x5168;&#x90E8;&#x5019;&#x9009;&#x5206;&#x5272;&#x70B9;&#xFF0C;&#x4E5F;&#x53EB;&#x505A;&#x5168;&#x5C40;&#x626B;&#x63CF;&#x6CD5;<blockquote>
<p>1 &#x904D;&#x5386;&#x6BCF;&#x4E2A;&#x7ED3;&#x70B9;&#x7684;&#x6BCF;&#x4E2A;&#x7279;&#x5F81;&#xFF1B;<br>2 &#x5BF9;&#x6BCF;&#x4E2A;&#x7279;&#x5F81;&#xFF0C;&#x6309;&#x7279;&#x5F81;&#x503C;&#x5927;&#x5C0F;&#x5C06;&#x7279;&#x5F81;&#x503C;&#x6392;&#x5E8F;&#xFF1B;<br>3 &#x7EBF;&#x6027;&#x626B;&#x63CF;&#xFF0C;&#x627E;&#x51FA;&#x6BCF;&#x4E2A;&#x7279;&#x5F81;&#x7684;&#x6700;&#x4F73;&#x5206;&#x88C2;&#x7279;&#x5F81;&#x503C;&#xFF1B;<br>4 &#x5728;&#x6240;&#x6709;&#x7279;&#x5F81;&#x4E2D;&#x627E;&#x51FA;&#x6700;&#x597D;&#x7684;&#x5206;&#x88C2;&#x70B9;&#xFF08;&#x5206;&#x88C2;&#x540E;&#x589E;&#x76CA;&#x6700;&#x5927;&#x7684;&#x7279;&#x5F81;&#x53CA;&#x7279;&#x5F81;&#x503C;&#xFF09;</p>
</blockquote>
</li>
</ul>
<h5 id="&#x505C;&#x6B62;&#x6811;&#x7684;&#x5FAA;&#x73AF;&#x751F;&#x6210;&#x65B9;&#x6CD5;"><a href="#&#x505C;&#x6B62;&#x6811;&#x7684;&#x5FAA;&#x73AF;&#x751F;&#x6210;&#x65B9;&#x6CD5;" class="headerlink" title="&#x505C;&#x6B62;&#x6811;&#x7684;&#x5FAA;&#x73AF;&#x751F;&#x6210;&#x65B9;&#x6CD5;"></a>&#x505C;&#x6B62;&#x6811;&#x7684;&#x5FAA;&#x73AF;&#x751F;&#x6210;&#x65B9;&#x6CD5;</h5><ul>
<li>&#x5F53;&#x5F15;&#x5165;&#x7684;&#x5206;&#x88C2;&#x5E26;&#x6765;&#x7684;&#x4FE1;&#x606F;&#x589E;&#x76CA;&#x5C0F;&#x4E8E;&#x8BBE;&#x5B9A;&#x9600;&#x503C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#x6389;&#x8FD9;&#x4E2A;&#x5206;&#x88C2;&#xFF08;&#x9884;&#x526A;&#x679D;&#xFF09;&#x3002;</li>
<li>&#x5F53;&#x6811;&#x8FBE;&#x5230;&#x6700;&#x5927;&#x6DF1;&#x5EA6;&#x65F6;&#x5219;&#x505C;&#x6B62;&#x5EFA;&#x7ACB;&#x51B3;&#x7B56;&#x6811;&#xFF0C;&#x907F;&#x514D;&#x6811;&#x592A;&#x6DF1;&#x5BFC;&#x81F4;&#x5B66;&#x4E60;&#x5C40;&#x90E8;&#x6837;&#x672C;&#xFF0C;&#x4ECE;&#x800C;&#x8FC7;&#x62DF;&#x5408;&#x3002;</li>
<li>&#x6837;&#x672C;&#x6743;&#x91CD;&#x548C;&#x5C0F;&#x4E8E;&#x8BBE;&#x5B9A;&#x9608;&#x503C;&#x65F6;&#x5219;&#x505C;&#x6B62;&#x5EFA;&#x6811;&#xFF0C;&#x5373;&#x4E00;&#x4E2A;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x6837;&#x672C;&#x592A;&#x5C11;&#x4E86;&#x5C31;&#x7EC8;&#x6B62;&#xFF0C;&#x9632;&#x6B62;&#x8FC7;&#x62DF;&#x5408;&#x3002;</li>
</ul>
<h5 id="XGBoost&#x4E0E;GBDT&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x540C;"><a href="#XGBoost&#x4E0E;GBDT&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x540C;" class="headerlink" title="XGBoost&#x4E0E;GBDT&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x540C;"></a>XGBoost&#x4E0E;GBDT&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x540C;</h5><ul>
<li>&#x5728;&#x4F7F;&#x7528;CART&#x4F5C;&#x4E3A;&#x57FA;&#x5206;&#x7C7B;&#x5668;&#x65F6;&#xFF0C;XGBoost&#x663E;&#x5F0F;&#x5730;&#x52A0;&#x5165;&#x4E86;&#x6B63;&#x5219;&#x9879;&#x6765;&#x63A7;&#x5236;&#x6A21;&#x578B;&#x7684;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x6709;&#x5229;&#x4E8E;&#x9632;&#x6B62;&#x8FC7;&#x62DF;&#x5408;&#xFF0C;&#x4ECE;&#x800C;&#x63D0;&#x9AD8;&#x6A21;&#x578B;&#x7684;&#x6CDB;&#x5316;&#x80FD;&#x529B;&#x3002;</li>
<li>GBDT&#x5728;&#x6A21;&#x578B;&#x8BAD;&#x7EC3;&#x65F6;&#x53EA;&#x4F7F;&#x7528;&#x4E86;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x7684;<u>&#x4E00;&#x9636;&#x5BFC;&#x6570;</u>&#x4FE1;&#x606F;&#xFF0C;XGBoost&#x5BF9;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x8FDB;&#x884C;&#x4E8C;&#x9636;&#x6CF0;&#x52D2;&#x5C55;&#x5F00;&#xFF0C;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x4F7F;&#x7528;&#x4E00;&#x9636;&#x548C;&#x4E8C;&#x9636;&#x5BFC;&#x6570;&#x3002;</li>
<li>&#x4F20;&#x7EDF;&#x7684;GBDT&#x53EA;&#x80FD;&#x91C7;&#x7528;CART&#x4F5C;&#x4E3A;&#x57FA;&#x5206;&#x7C7B;&#x5668;&#xFF0C;XGBoost&#x652F;&#x6301;&#x591A;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x57FA;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x6BD4;&#x5982;&#x7EBF;&#x6027;&#x5206;&#x7C7B;&#x5668;&#x3002;</li>
<li>&#x4F20;&#x7EDF;&#x7684;GBDT&#x5728;&#x6BCF;&#x8F6E;&#x8FED;&#x4EE3;&#x65F6;&#x4F7F;&#x7528;&#x5168;&#x90E8;&#x7684;&#x6570;&#x636E;&#xFF0C;XGBoost&#x5219;&#x91C7;&#x7528;&#x4E86;&#x4E0E;&#x968F;&#x673A;&#x68EE;&#x6797;&#x76F8;&#x4F3C;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x652F;&#x6301;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x91C7;&#x6837;&#x3002;</li>
<li>&#x4F20;&#x7EDF;&#x7684;GBDT&#x6CA1;&#x6709;&#x8BBE;&#x8BA1;&#x5BF9;&#x7F3A;&#x5931;&#x503C;&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF0C;XGBoost&#x80FD;&#x591F;&#x81EA;&#x52A8;&#x5B66;&#x4E60;&#x51FA;&#x7F3A;&#x5931;&#x503C;&#x7684;&#x5904;&#x7406;&#x7B56;&#x7565;&#x3002;</li>
</ul>
<p>&#x4E8C;&#x9636;&#x6CF0;&#x52D2;&#x5C55;&#x5F00;&#x7684;&#x597D;&#x5904;<br>XGBoost&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x9636;&#x548C;&#x4E8C;&#x9636;&#x504F;&#x5BFC;, &#x4E8C;&#x9636;&#x5BFC;&#x6570;&#x6709;&#x5229;&#x4E8E;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x66F4;&#x5FEB;&#x66F4;&#x51C6;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x9009;&#x5B9A;&#x635F;&#x5931;&#x51FD;&#x6570;&#x5177;&#x4F53;&#x5F62;&#x5F0F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;, &#x4EC5;&#x4EC5;&#x4F9D;&#x9760;&#x8F93;&#x5165;&#x6570;&#x636E;&#x7684;&#x503C;&#x5C31;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x53F6;&#x5B50;&#x5206;&#x88C2;&#x4F18;&#x5316;&#x8BA1;&#x7B97;&#xFF08;&#x4E0D;&#x7406;&#x89E3;&#xFF09;&#x3002;<br>&#x53C2;&#x8003;&#xFF1A;<br><a href="https://www.lizenghai.com/archives/21670.html" target="_blank" rel="noopener">&#x7EC8;&#x4E8E;&#x6709;&#x4EBA;&#x8BF4;&#x6E05;&#x695A;&#x4E86;&#x2013;XGBoost&#x7B97;&#x6CD5;&#x2013;&#x7CBE;&#x534E;</a><br><a href="https://zhuanlan.zhihu.com/p/92837676" target="_blank" rel="noopener">XGBoost&#x8D85;&#x8BE6;&#x7EC6;&#x63A8;&#x5BFC;</a></p>
<p>&#x516C;&#x5F0F;&#x56DE;&#x987E;&#xFF1A;<br><img src="/2020/04/05/%E9%9B%86%E6%88%90%E5%AD%A6%E4%B9%A0/8.png" alt="72d798c8ccba1bbba19c3660f6a83524.png"><br>&#x539F;&#x56E0;&#xFF1A;<br><a href="https://zhuanlan.zhihu.com/p/29765582" target="_blank" rel="noopener">&#x76EE;&#x6807;&#x51FD;&#x6570;&#x7684;&#x4E8C;&#x9636;&#x6CF0;&#x52D2;</a></p>
<hr>
<h5 id="LightGBM-&#x548C;-XGBoost-&#x7684;&#x7ED3;&#x6784;&#x5DEE;&#x5F02;"><a href="#LightGBM-&#x548C;-XGBoost-&#x7684;&#x7ED3;&#x6784;&#x5DEE;&#x5F02;" class="headerlink" title="LightGBM &#x548C; XGBoost &#x7684;&#x7ED3;&#x6784;&#x5DEE;&#x5F02;"></a>LightGBM &#x548C; XGBoost &#x7684;&#x7ED3;&#x6784;&#x5DEE;&#x5F02;</h5><hr>
<h5 id="LightGBM"><a href="#LightGBM" class="headerlink" title="LightGBM"></a>LightGBM</h5><p>LGBM&#x91C7;&#x7528;leaf-wise&#x751F;&#x957F;&#x7B56;&#x7565;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x57FA;&#x4E8E;&#x68AF;&#x5EA6;&#x7684;&#x5355;&#x4FA7;&#x91C7;&#x6837;&#xFF08;GOSS&#xFF09;&#x6765;&#x627E;&#x51FA;&#x7528;&#x4E8E;&#x5206;&#x88C2;&#x7684;&#x6570;&#x636E;&#x5B9E;&#x4F8B;&#xFF0C;&#x5F53;&#x589E;&#x957F;&#x5230;&#x76F8;&#x540C;&#x7684;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x65F6;&#xFF0C;LGBM&#x4F1A;&#x76F4;&#x63A5;&#x627E;&#x51FA;&#x5206;&#x88C2;&#x589E;&#x76CA;&#x6700;&#x5927;&#x7684;&#x53F6;&#x5B50;&#xFF08;&#x901A;&#x5E38;&#x662F;&#x6570;&#x636E;&#x6700;&#x5927;&#x5768;&#x7684;&#x90A3;&#x4E2A;&#xFF09;&#xFF0C;&#x53EA;&#x5206;&#x88C2;&#x4E00;&#x4E2A;&#x3002;<br><img src="/2020/04/05/%E9%9B%86%E6%88%90%E5%AD%A6%E4%B9%A0/9.png" alt="d61beae9a3000354b73978787444bfb8.png"></p>
<h5 id="XGBoost-1"><a href="#XGBoost-1" class="headerlink" title="XGBoost"></a>XGBoost</h5><p>&#x91C7;&#x7528;&#x7684;&#x5219;&#x662F;level&#xFF08;depth&#xFF09;-wise&#x751F;&#x957F;&#x7B56;&#x7565;&#xFF0C;&#x5B83;&#x7528;&#x9884;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;+&#x76F4;&#x65B9;&#x56FE;&#x7B97;&#x6CD5;&#x4E3A;&#x6BCF;&#x4E00;&#x5C42;&#x7684;&#x53F6;&#x5B50;&#x627E;&#x51FA;&#x6700;&#x4F73;&#x5206;&#x88C2;&#xFF0C;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x5C31;&#x662F;&#x5B83;&#x662F;&#x4E0D;&#x52A0;&#x533A;&#x5206;&#x5730;&#x5206;&#x88C2;&#x540C;&#x4E00;&#x5C42;&#x6240;&#x6709;&#x53F6;&#x5B50;&#x3002;</p>
<p>&#x9884;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x7684;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#xFF1A;</p>
<ul>
<li>&#x5BF9;&#x6BCF;&#x4E2A;&#x53F6;&#x5B50;&#xFF08;&#x5206;&#x5272;&#x70B9;&#xFF09;&#x904D;&#x5386;&#x6240;&#x6709;&#x7279;&#x5F81;&#xFF1B;</li>
<li>&#x5BF9;&#x6BCF;&#x4E2A;&#x7279;&#x5F81;&#xFF0C;&#x6309;&#x7279;&#x5F81;&#x503C;&#x5BF9;&#x6570;&#x636E;&#x70B9;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#xFF1B;</li>
<li>&#x786E;&#x5B9A;&#x5F53;&#x524D;&#x7279;&#x5F81;&#x7684;&#x57FA;&#x672C;&#x5206;&#x88C2;&#x589E;&#x76CA;&#xFF0C;&#x7528;&#x7EBF;&#x6027;&#x626B;&#x63CF;&#x51B3;&#x5B9A;&#x6700;&#x4F73;&#x5206;&#x88C2;&#x65B9;&#x6CD5;&#xFF1B;</li>
<li>&#x57FA;&#x4E8E;&#x6240;&#x6709;&#x7279;&#x5F81;&#x91C7;&#x53D6;&#x6700;&#x4F73;&#x5206;&#x88C2;&#x65B9;&#x6CD5;&#x3002;<br><img src="/2020/04/05/%E9%9B%86%E6%88%90%E5%AD%A6%E4%B9%A0/10.png" alt="d033fbeb78d866f33e6244aff981eef7.png"><br>GOSS&#x9AD8;&#x6548;&#x7684;&#x539F;&#x56E0;&#xFF1A;</li>
<li>&#x5728;AdaBoost&#x4E2D;&#xFF0C;&#x6570;&#x636E;&#x70B9;&#x7684;&#x6743;&#x91CD;&#x662F;&#x6570;&#x636E;&#x70B9;&#x91CD;&#x8981;&#x4E0E;&#x5426;&#x7684;&#x4E00;&#x4E2A;&#x76F4;&#x89C2;&#x6307;&#x6807;&#xFF0C;&#x4F46;&#x68AF;&#x5EA6;&#x63D0;&#x5347;&#x51B3;&#x7B56;&#x6811;&#xFF08;GBDT&#xFF09;&#x4E0D;&#x81EA;&#x5E26;&#x8FD9;&#x79CD;&#x6743;&#x91CD;&#xFF0C;&#x56E0;&#x6B64;&#x4E5F;&#x5C31;&#x65E0;&#x6CD5;&#x6CBF;&#x7528;AdaBoost&#x7684;&#x91C7;&#x6837;&#x65B9;&#x6CD5;&#x3002;</li>
<li>GOSS&#x4FDD;&#x7559;&#x4E86;&#x6240;&#x6709;&#x5177;&#x6709;&#x5927;&#x68AF;&#x5EA6;&#x7684;&#x6570;&#x636E;&#x70B9;&#xFF0C;&#x5E76;&#x5BF9;&#x68AF;&#x5EA6;&#x5C0F;&#x7684;&#x6570;&#x636E;&#x70B9;&#x8FDB;&#x884C;&#x968F;&#x673A;&#x91C7;&#x6837;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x8BBE;&#x6211;&#x6709;50&#x4E07;&#x884C;&#x6570;&#x636E;&#xFF0C;&#x5176;&#x4E2D;1&#x4E07;&#x884C;&#x68AF;&#x5EA6;&#x9AD8;&#xFF0C;&#x5269;&#x4E0B;&#x7684;49&#x4E07;&#x884C;&#x68AF;&#x5EA6;&#x4F4E;&#xFF0C;&#x90A3;&#x6211;&#x7684;&#x7B97;&#x6CD5;&#x5C31;&#x4F1A;&#x9009;&#x62E9;1&#x4E07;&#x884C;+49&#x4E07;&#x884C;&#xD7;x%&#xFF08;&#x968F;&#x673A;&#xFF09;&#x3002;&#x8BBE;x=10&#xFF0C;&#x6700;&#x7EC8;&#x7B97;&#x6CD5;&#x9009;&#x51FA;&#x7684;&#x5C31;&#x662F;50&#x4E07;&#x884C;&#x6570;&#x636E;&#x4E2D;&#x7684;5.9&#x4E07;&#x884C;&#x3002;</li>
</ul>
<h5 id="CatBoost"><a href="#CatBoost" class="headerlink" title="CatBoost"></a>CatBoost</h5><hr>
<ul>
<li>CatBoost&#x5728;&#x5206;&#x7C7B;&#x53D8;&#x91CF;&#x7D22;&#x5F15;&#x65B9;&#x9762;&#x5177;&#x6709;&#x76F8;&#x5F53;&#x7684;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x7528;&#x5728;&#x5404;&#x79CD;&#x7EDF;&#x8BA1;&#x4E0A;&#x7684;&#x5206;&#x7C7B;&#x7279;&#x5F81;&#x548C;&#x6570;&#x503C;&#x7279;&#x5F81;&#x7684;&#x7EC4;&#x5408;&#x5C06;&#x5206;&#x7C7B;&#x503C;&#x7F16;&#x7801;&#x6210;&#x6570;&#x5B57;&#xFF08;one_hot_max_size&#xFF1A;&#x5982;&#x679C;feature&#x5305;&#x542B;&#x7684;&#x4E0D;&#x540C;&#x503C;&#x7684;&#x6570;&#x76EE;&#x8D85;&#x8FC7;&#x4E86;&#x6307;&#x5B9A;&#x503C;&#xFF0C;&#x5C06;feature&#x8F6C;&#x5316;&#x4E3A;float&#xFF09;&#x3002;</li>
<li>LightGBM&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8F93;&#x5165;&#x7279;&#x5F81;&#x540D;&#x79F0;&#x6765;&#x5904;&#x7406;&#x5206;&#x7C7B;&#x7279;&#x5F81;&#x3002;&#x5B83;&#x65E0;&#x9700;&#x8FDB;&#x884C;&#x72EC;&#x70ED;&#x7F16;&#x7801;&#xFF08;one-hot coding&#xFF09;&#xFF0C;&#x800C;&#x662F;&#x4F7F;&#x7528;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x7B97;&#x6CD5;&#x76F4;&#x63A5;&#x67E5;&#x627E;&#x5206;&#x7C7B;&#x7279;&#x5F81;&#x7684;&#x62C6;&#x5206;&#x503C;&#xFF0C;&#x6700;&#x540E;&#x4E0D;&#x4EC5;&#x6548;&#x679C;&#x76F8;&#x4F3C;&#xFF0C;&#x800C;&#x4E14;&#x901F;&#x5EA6;&#x66F4;&#x5FEB;&#x3002;</li>
<li>XGBoost&#x65E0;&#x6CD5;&#x5355;&#x72EC;&#x5904;&#x7406;&#x5206;&#x7C7B;&#x7279;&#x5F81;&#xFF0C;&#x5B83;&#x662F;&#x57FA;&#x4E8E;CART&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x53EA;&#x63A5;&#x6536;&#x6570;&#x503C;&#x3002;&#x5728;&#x628A;&#x5206;&#x7C7B;&#x6570;&#x636E;&#x63D0;&#x4F9B;&#x7ED9;&#x7B97;&#x6CD5;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x5F97;&#x6267;&#x884C;&#x5404;&#x79CD;&#x7F16;&#x7801;&#xFF0C;&#x5982;&#x6807;&#x7B7E;&#x7F16;&#x7801;&#x3001;&#x5747;&#x503C;&#x7F16;&#x7801;&#x3001;&#x72EC;&#x70ED;&#x7F16;&#x7801;&#x7B49;&#x3002;</li>
</ul>
<p>&#x5982;&#x679C;&#x6570;&#x636E;&#x4E2D;&#x5B58;&#x5728;&#x5206;&#x7C7B;&#x53D8;&#x91CF;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5145;&#x5206;&#x5229;&#x7528;CatBoost&#x7684;&#x7279;&#x6027;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x66F4;&#x597D;&#x7684;&#x8BAD;&#x7EC3;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x53C2;&#x8003;&#xFF1A;<br><a href="https://www.cnblogs.com/lvdongjie/p/11391245.html" target="_blank" rel="noopener">XGBoost&#x3001;LightGBM&#x3001;Catboost&#x603B;&#x7ED3;</a><br><a href="https://mp.weixin.qq.com/s?src=11&amp;timestamp=1586021785&amp;ver=2258&amp;signature=TlU7xleEjndboN1aBS0*ASDAXpTt1pXeyN6ESsxt3huj5mNDyteOSYANFYIBAfLYH1jWci3qNq8nGB7L*msNPw6QOQIBLa8A7g6Ce58MdXwla2ymvDxbS3sqqBuEr1yX&amp;new=1" target="_blank" rel="noopener">&#x4E00;&#x6587;&#x6982;&#x8FF0;XGBoost&#x3001;Light GBM&#x548C;CatBoost&#x7684;&#x540C;&#x4E0E;&#x4E0D;&#x540C;</a></p>

            <!--[if lt IE 9]><script>document.createElement('audio');</script><![endif]-->
            <audio id="audio" loop="1" preload="auto" controls="controls" data-autoplay="false">
                <source type="audio/mpeg" src="">
            </audio>
            
                <ul id="audio-list" style="display:none">
                    
                        
                            <li title='0' data-url='http://music.163.com/song/media/outer/url?id=1384026889.mp3'></li>
                        
                    
                        
                            <li title='1' data-url='http://music.163.com/song/media/outer/url?id=1341912654.mp3'></li>
                        
                    
                </ul>
            
        </div>
        
    <div id='gitalk-container' class="comment link"
		data-enable='true'
        data-ae='false'
        data-ci='7d6a5a19e87fc16b2000'
        data-cs='24053baf541ca1615e037a8b6f10e90728e944fd'
        data-r='windyxh.github.io'
        data-o='windyxh'
        data-a='windyxh'
        data-d='true'
    >查看评论</div>


    </div>
    
</div>


    </div>
</div>
</body>

<script src="//cdn.jsdelivr.net/npm/gitalk@1/dist/gitalk.min.js"></script>


<script src="//lib.baomitu.com/jquery/1.8.3/jquery.min.js"></script>
<script src="/js/plugin.js"></script>
<script src="/js/typed.js"></script>
<script src="/js/diaspora.js"></script>


<link rel="stylesheet" href="/photoswipe/photoswipe.css">
<link rel="stylesheet" href="/photoswipe/default-skin/default-skin.css">


<script src="/photoswipe/photoswipe.min.js"></script>
<script src="/photoswipe/photoswipe-ui-default.min.js"></script>


<!-- Root element of PhotoSwipe. Must have class pswp. -->
<div class="pswp" tabindex="-1" role="dialog" aria-hidden="true">
    <!-- Background of PhotoSwipe. 
         It's a separate element as animating opacity is faster than rgba(). -->
    <div class="pswp__bg"></div>
    <!-- Slides wrapper with overflow:hidden. -->
    <div class="pswp__scroll-wrap">
        <!-- Container that holds slides. 
            PhotoSwipe keeps only 3 of them in the DOM to save memory.
            Don't modify these 3 pswp__item elements, data is added later on. -->
        <div class="pswp__container">
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
        </div>
        <!-- Default (PhotoSwipeUI_Default) interface on top of sliding area. Can be changed. -->
        <div class="pswp__ui pswp__ui--hidden">
            <div class="pswp__top-bar">
                <!--  Controls are self-explanatory. Order can be changed. -->
                <div class="pswp__counter"></div>
                <button class="pswp__button pswp__button--close" title="Close (Esc)"></button>
                <button class="pswp__button pswp__button--share" title="Share"></button>
                <button class="pswp__button pswp__button--fs" title="Toggle fullscreen"></button>
                <button class="pswp__button pswp__button--zoom" title="Zoom in/out"></button>
                <!-- Preloader demo http://codepen.io/dimsemenov/pen/yyBWoR -->
                <!-- element will get class pswp__preloader--active when preloader is running -->
                <div class="pswp__preloader">
                    <div class="pswp__preloader__icn">
                      <div class="pswp__preloader__cut">
                        <div class="pswp__preloader__donut"></div>
                      </div>
                    </div>
                </div>
            </div>
            <div class="pswp__share-modal pswp__share-modal--hidden pswp__single-tap">
                <div class="pswp__share-tooltip"></div> 
            </div>
            <button class="pswp__button pswp__button--arrow--left" title="Previous (arrow left)">
            </button>
            <button class="pswp__button pswp__button--arrow--right" title="Next (arrow right)">
            </button>
            <div class="pswp__caption">
                <div class="pswp__caption__center"></div>
            </div>
        </div>
    </div>
</div>






</html>
