
<!DOCTYPE html>
<html lang="en" class="loading">
<head>
    <meta charset="UTF-8" />
    <meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
    <meta name="viewport" content="width=device-width, minimum-scale=1.0, maximum-scale=1.0, user-scalable=no">
    <title>决策树 - Xuhui</title>
    <meta name="apple-mobile-web-app-capable" content="yes" />
    <meta name="apple-mobile-web-app-status-bar-style" content="black-translucent">
    <meta name="google" content="notranslate" />
    <meta name="keywords" content="Fechin,"> 
    <meta name="description" content="&amp;#x51B3;&amp;#x7B56;&amp;#x6811;
&amp;#x51B3;&amp;#x7B56;&amp;#x6811;ID3&amp;#x7B97;&amp;#x6CD5;&amp;#x7684;&amp;#x4E0D;&amp;#x8DB3;
ID3&amp;#x,"> 
    <meta name="author" content="Xuhui"> 
    <link rel="alternative" href="atom.xml" title="Xuhui" type="application/atom+xml"> 
    <link rel="icon" href="/img/logo.jpg"> 
    
<link rel="stylesheet" href="//cdn.jsdelivr.net/npm/gitalk@1/dist/gitalk.css">

    
<link rel="stylesheet" href="/css/diaspora.css">

	<script async src="//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script>
    <script>
         (adsbygoogle = window.adsbygoogle || []).push({
              google_ad_client: "ca-pub-8691406134231910",
              enable_page_level_ads: true
         });
    </script>
    <script async custom-element="amp-auto-ads"
        src="https://cdn.ampproject.org/v0/amp-auto-ads-0.1.js">
    </script>
<meta name="generator" content="Hexo 4.2.0"></head>

<body class="loading">
    <span id="config-title" style="display:none">Xuhui</span>
    <div id="loader"></div>
    <div id="single">
    <div id="top" style="display: block;">
    <div class="bar" style="width: 0;"></div>
    <a class="iconfont icon-home image-icon" href="javascript:;" data-url="http://yoursite.com"></a>
    <div title="播放/暂停" class="iconfont icon-play"></div>
    <h3 class="subtitle">决策树</h3>
    <div class="social">
        <div>
            <div class="share">
                <a title="获取二维码" class="iconfont icon-scan" href="javascript:;"></a>
            </div>
            <div id="qr"></div>
        </div>
    </div>
    <div class="scrollbar"></div>
</div>

    <div class="section">
        <div class="article">
    <div class='main'>
        <h1 class="title">决策树</h1>
        <div class="stuff">
            <span>四月 05, 2020</span>
            
  <ul class="post-tags-list" itemprop="keywords"><li class="post-tags-list-item"><a class="post-tags-list-link" href="/tags/%E5%86%B3%E7%AD%96%E6%A0%91/" rel="tag">决策树</a></li></ul>


        </div>
        <div class="content markdown">
            <h3 id="&#x51B3;&#x7B56;&#x6811;"><a href="#&#x51B3;&#x7B56;&#x6811;" class="headerlink" title="&#x51B3;&#x7B56;&#x6811;"></a>&#x51B3;&#x7B56;&#x6811;</h3><hr>
<h4 id="&#x51B3;&#x7B56;&#x6811;ID3&#x7B97;&#x6CD5;&#x7684;&#x4E0D;&#x8DB3;"><a href="#&#x51B3;&#x7B56;&#x6811;ID3&#x7B97;&#x6CD5;&#x7684;&#x4E0D;&#x8DB3;" class="headerlink" title="&#x51B3;&#x7B56;&#x6811;ID3&#x7B97;&#x6CD5;&#x7684;&#x4E0D;&#x8DB3;"></a>&#x51B3;&#x7B56;&#x6811;ID3&#x7B97;&#x6CD5;&#x7684;&#x4E0D;&#x8DB3;</h4><ul>
<li><p>ID3&#x6CA1;&#x6709;&#x8003;&#x8651;&#x8FDE;&#x7EED;&#x7279;&#x5F81;&#xFF0C;&#x6BD4;&#x5982;&#x957F;&#x5EA6;&#xFF0C;&#x5BC6;&#x5EA6;&#x90FD;&#x662F;&#x8FDE;&#x7EED;&#x503C;</p>
</li>
<li><p>ID3&#x91C7;&#x7528;&#x4FE1;&#x606F;&#x589E;&#x76CA;&#x5927;&#x7684;&#x7279;&#x5F81;&#x4F18;&#x5148;&#x5EFA;&#x7ACB;&#x51B3;&#x7B56;&#x6811;&#x7684;&#x8282;&#x70B9;&#x3002;&#x5728;&#x76F8;&#x540C;&#x6761;&#x4EF6;&#x4E0B;&#xFF0C;&#x53D6;&#x503C;&#x6BD4;&#x8F83;&#x591A;&#x7684;&#x7279;&#x5F81;&#x6BD4;&#x53D6;&#x503C;&#x5C11;&#x7684;&#x7279;&#x5F81;&#x4FE1;&#x606F;&#x589E;&#x76CA;&#x5927;&#x3002;</p>
<blockquote>
<p>&#x6BD4;&#x5982;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x6709;2&#x4E2A;&#x503C;&#xFF0C;&#x5404;&#x4E3A;1/2&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x4E3A;3&#x4E2A;&#x503C;&#xFF0C;&#x5404;&#x4E3A;1/3&#xFF0C;&#x5176;&#x5B9E;&#x4ED6;&#x4EEC;&#x90FD;&#x662F;&#x5B8C;&#x5168;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x4F46;&#x662F;&#x53D6;3&#x4E2A;&#x503C;&#x7684;&#x6BD4;&#x53D6;2&#x4E2A;&#x503C;&#x7684;&#x4FE1;&#x606F;&#x589E;&#x76CA;&#x5927;&#x3002;</p>
</blockquote>
</li>
<li><p>ID3&#x7B97;&#x6CD5;&#x5BF9;&#x4E8E;&#x7F3A;&#x5931;&#x503C;&#x7684;&#x60C5;&#x51B5;&#x6CA1;&#x6709;&#x505A;&#x8003;&#x8651;&#x3002;</p>
</li>
<li><p>&#x6CA1;&#x6709;&#x8003;&#x8651;&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x95EE;&#x9898;</p>
</li>
</ul>
<h4 id="C4-5&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#xFF08;&#x4F9D;&#x6B21;&#x5BF9;&#x5E94;ID3&#x7684;&#x4E0D;&#x8DB3;&#xFF09;"><a href="#C4-5&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#xFF08;&#x4F9D;&#x6B21;&#x5BF9;&#x5E94;ID3&#x7684;&#x4E0D;&#x8DB3;&#xFF09;" class="headerlink" title="C4.5&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#xFF08;&#x4F9D;&#x6B21;&#x5BF9;&#x5E94;ID3&#x7684;&#x4E0D;&#x8DB3;&#xFF09;"></a>C4.5&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#xFF08;&#x4F9D;&#x6B21;&#x5BF9;&#x5E94;ID3&#x7684;&#x4E0D;&#x8DB3;&#xFF09;</h4><ul>
<li><p>C4.5&#x7684;&#x601D;&#x8DEF;&#x662F;&#x5C06;&#x8FDE;&#x7EED;&#x7684;&#x7279;&#x5F81;&#x79BB;&#x6563;&#x5316;&#xFF0C;&#x5C06;m&#x4E2A;&#x7279;&#x5F81;&#x6392;&#x5E8F;&#xFF0C;C4.5&#x53D6;&#x76F8;&#x90BB;&#x4E24;&#x6837;&#x672C;&#x503C;&#x7684;&#x5E73;&#x5747;&#x6570;&#xFF0C;&#x4E00;&#x5171;&#x53D6;&#x5F97;m-1&#x4E2A;&#x5212;&#x5206;&#x70B9;&#x3002;</p>
</li>
<li><p>&#x5F15;&#x5165;&#x4E00;&#x4E2A;&#x4FE1;&#x606F;&#x589E;&#x76CA;&#x6BD4;&#xFF0C;&#x5B83;&#x662F;&#x4FE1;&#x606F;&#x589E;&#x76CA;&#x548C;&#x7279;&#x5F81;&#x71B5;&#x7684;&#x6BD4;&#x503C;<br><img src="/2020/04/05/%E5%86%B3%E7%AD%96%E6%A0%91/1.png" alt="e076f7452240776a3be5a787c77c33e8.png"><br>&#x7279;&#x5F81;&#x6570;&#x8D8A;&#x591A;&#x7684;&#x7279;&#x5F81;&#x5BF9;&#x5E94;&#x7684;&#x7279;&#x5F81;&#x71B5;&#x8D8A;&#x5927;&#xFF0C;&#x5B83;&#x4F5C;&#x4E3A;&#x5206;&#x6BCD;&#xFF0C;&#x53EF;&#x4EE5;&#x6821;&#x6B63;&#x4FE1;&#x606F;&#x589E;&#x76CA;&#x5BB9;&#x6613;&#x504F;&#x5411;&#x4E8E;&#x53D6;&#x503C;&#x8F83;&#x591A;&#x7684;&#x7279;&#x5F81;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
</li>
<li><p>&#x5BF9;&#x4E8E;&#x7B2C;&#x4E09;&#x4E2A;&#x7F3A;&#x5931;&#x503C;&#x5904;&#x7406;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E3B;&#x8981;&#x9700;&#x8981;&#x89E3;&#x51B3;&#x7684;&#x662F;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x662F;&#x5728;&#x6837;&#x672C;&#x67D0;&#x4E9B;&#x7279;&#x5F81;&#x7F3A;&#x5931;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x9009;&#x62E9;&#x5212;&#x5206;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x4E8C;&#x662F;&#x9009;&#x5B9A;&#x4E86;&#x5212;&#x5206;&#x5C5E;&#x6027;&#xFF0C;&#x5BF9;&#x4E8E;&#x5728;&#x8BE5;&#x5C5E;&#x6027;&#x4E0A;&#x7F3A;&#x5931;&#x7279;&#x5F81;&#x7684;&#x6837;&#x672C;&#x7684;&#x5904;&#x7406;&#x3002;</p>
<blockquote>
<p>&#x5BF9;&#x4E8E;&#x7B2C;&#x4E00;&#x4E2A;&#x5B50;&#x95EE;&#x9898;&#xFF0C;&#x5BF9;&#x4E8E;&#x67D0;&#x4E00;&#x4E2A;&#x6709;&#x7F3A;&#x5931;&#x7279;&#x5F81;&#x503C;&#x7684;&#x7279;&#x5F81;A&#x3002;C4.5&#x7684;&#x601D;&#x8DEF;&#x662F;&#x5C06;&#x6570;&#x636E;&#x5206;&#x6210;&#x4E24;&#x90E8;&#x5206;&#xFF0C;&#x5BF9;&#x6BCF;&#x4E2A;&#x6837;&#x672C;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x6743;&#x91CD;&#xFF08;&#x521D;&#x59CB;&#x53EF;&#x4EE5;&#x90FD;&#x4E3A;1&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x5212;&#x5206;&#x6570;&#x636E;&#xFF0C;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x6709;&#x7279;&#x5F81;&#x503C;A&#x7684;&#x6570;&#x636E;D1&#xFF0C;&#x53E6;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x6CA1;&#x6709;&#x7279;&#x5F81;A&#x7684;&#x6570;&#x636E;D2. &#x7136;&#x540E;&#x5BF9;&#x4E8E;&#x6CA1;&#x6709;&#x7F3A;&#x5931;&#x7279;&#x5F81;A&#x7684;&#x6570;&#x636E;&#x96C6;D1&#x6765;&#x548C;&#x5BF9;&#x5E94;&#x7684;A&#x7279;&#x5F81;&#x7684;&#x5404;&#x4E2A;&#x7279;&#x5F81;&#x503C;&#x4E00;&#x8D77;&#x8BA1;&#x7B97;&#x52A0;&#x6743;&#x91CD;&#x540E;&#x7684;&#x4FE1;&#x606F;&#x589E;&#x76CA;&#x6BD4;&#xFF0C;&#x6700;&#x540E;&#x4E58;&#x4E0A;&#x4E00;&#x4E2A;&#x7CFB;&#x6570;&#xFF0C;&#x8FD9;&#x4E2A;&#x7CFB;&#x6570;&#x662F;&#x65E0;&#x7279;&#x5F81;A&#x7F3A;&#x5931;&#x7684;&#x6837;&#x672C;&#x52A0;&#x6743;&#x540E;&#x6240;&#x5360;&#x52A0;&#x6743;&#x603B;&#x6837;&#x672C;&#x7684;&#x6BD4;&#x4F8B;&#x3002;<br>&#x5BF9;&#x4E8E;&#x7B2C;&#x4E8C;&#x4E2A;&#x5B50;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x7F3A;&#x5931;&#x7279;&#x5F81;&#x7684;&#x6837;&#x672C;&#x540C;&#x65F6;&#x5212;&#x5206;&#x5165;&#x6240;&#x6709;&#x7684;&#x5B50;&#x8282;&#x70B9;&#xFF0C;&#x4E0D;&#x8FC7;&#x5C06;&#x8BE5;&#x6837;&#x672C;&#x7684;&#x6743;&#x91CD;&#x6309;&#x5404;&#x4E2A;&#x5B50;&#x8282;&#x70B9;&#x6837;&#x672C;&#x7684;&#x6570;&#x91CF;&#x6BD4;&#x4F8B;&#x6765;&#x5206;&#x914D;&#x3002;&#x6BD4;&#x5982;&#x7F3A;&#x5931;&#x7279;&#x5F81;A&#x7684;&#x6837;&#x672C;a&#x4E4B;&#x524D;&#x6743;&#x91CD;&#x4E3A;1&#xFF0C;&#x7279;&#x5F81;A&#x6709;3&#x4E2A;&#x7279;&#x5F81;&#x503C;A1,A2,A3&#x3002;3&#x4E2A;&#x7279;&#x5F81;&#x503C;&#x5BF9;&#x5E94;&#x7684;&#x65E0;&#x7F3A;&#x5931;A&#x7279;&#x5F81;&#x7684;&#x6837;&#x672C;&#x4E2A;&#x6570;&#x4E3A;2,3,4.&#x5219;a&#x540C;&#x65F6;&#x5212;&#x5206;&#x5165;A1&#xFF0C;A2&#xFF0C;A3&#x3002;&#x5BF9;&#x5E94;&#x6743;&#x91CD;&#x8C03;&#x8282;&#x4E3A;2/9,3/9, 4/9&#x3002;</p>
</blockquote>
</li>
<li><p>C4.5&#x5F15;&#x5165;&#x4E86;&#x6B63;&#x5219;&#x5316;&#x7CFB;&#x6570;&#x8FDB;&#x884C;&#x521D;&#x6B65;&#x7684;&#x526A;&#x679D;&#x3002;</p>
</li>
</ul>
<h4 id="&#x51B3;&#x7B56;&#x6811;C4-5&#x7B97;&#x6CD5;&#x7684;&#x4E0D;&#x8DB3;"><a href="#&#x51B3;&#x7B56;&#x6811;C4-5&#x7B97;&#x6CD5;&#x7684;&#x4E0D;&#x8DB3;" class="headerlink" title="&#x51B3;&#x7B56;&#x6811;C4.5&#x7B97;&#x6CD5;&#x7684;&#x4E0D;&#x8DB3;"></a>&#x51B3;&#x7B56;&#x6811;C4.5&#x7B97;&#x6CD5;&#x7684;&#x4E0D;&#x8DB3;</h4><ul>
<li>&#x7531;&#x4E8E;&#x51B3;&#x7B56;&#x6811;&#x7B97;&#x6CD5;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x8FC7;&#x62DF;&#x5408;&#xFF0C;&#x56E0;&#x6B64;&#x5BF9;&#x4E8E;&#x751F;&#x6210;&#x7684;&#x51B3;&#x7B56;&#x6811;&#x5FC5;&#x987B;&#x8981;&#x8FDB;&#x884C;&#x526A;&#x679D;&#x3002;&#x526A;&#x679D;&#x7684;&#x7B97;&#x6CD5;&#x6709;&#x975E;&#x5E38;&#x591A;&#xFF0C;C4.5&#x7684;&#x526A;&#x679D;&#x65B9;&#x6CD5;&#x6709;&#x4F18;&#x5316;&#x7684;&#x7A7A;&#x95F4;&#x3002;&#x601D;&#x8DEF;&#x4E3B;&#x8981;&#x662F;&#x4E24;&#x79CD;&#xFF0C;&#x4E00;&#x79CD;&#x662F;&#x9884;&#x526A;&#x679D;&#xFF0C;&#x5373;&#x5728;&#x751F;&#x6210;&#x51B3;&#x7B56;&#x6811;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x526A;&#x679D;&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x662F;&#x540E;&#x526A;&#x679D;&#xFF0C;&#x5373;&#x5148;&#x751F;&#x6210;&#x51B3;&#x7B56;&#x6811;&#xFF0C;&#x518D;&#x901A;&#x8FC7;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x6765;&#x526A;&#x679D;&#x3002;</li>
<li>C4.5&#x751F;&#x6210;&#x7684;&#x662F;&#x591A;&#x53C9;&#x6811;&#xFF0C;&#x5373;&#x4E00;&#x4E2A;&#x7236;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#x3002;&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x4E8C;&#x53C9;&#x6811;&#x6A21;&#x578B;&#x4F1A;&#x6BD4;&#x591A;&#x53C9;&#x6811;&#x8FD0;&#x7B97;&#x6548;&#x7387;&#x9AD8;&#x3002;&#x5982;&#x679C;&#x91C7;&#x7528;&#x4E8C;&#x53C9;&#x6811;&#xFF0C;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x6548;&#x7387;&#x3002;</li>
<li>C4.5&#x53EA;&#x80FD;&#x7528;&#x4E8E;&#x5206;&#x7C7B;&#xFF0C;&#x5982;&#x679C;&#x80FD;&#x5C06;&#x51B3;&#x7B56;&#x6811;&#x7528;&#x4E8E;&#x56DE;&#x5F52;&#x7684;&#x8BDD;&#x53EF;&#x4EE5;&#x6269;&#x5927;&#x5B83;&#x7684;&#x4F7F;&#x7528;&#x8303;&#x56F4;&#x3002;</li>
<li>C4.5&#x7531;&#x4E8E;&#x4F7F;&#x7528;&#x4E86;&#x71B5;&#x6A21;&#x578B;&#xFF0C;&#x91CC;&#x9762;&#x6709;&#x5927;&#x91CF;&#x7684;&#x8017;&#x65F6;&#x7684;&#x5BF9;&#x6570;&#x8FD0;&#x7B97;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x8FDE;&#x7EED;&#x503C;&#x8FD8;&#x6709;&#x5927;&#x91CF;&#x7684;&#x6392;&#x5E8F;&#x8FD0;&#x7B97;&#x3002;&#x5982;&#x679C;&#x80FD;&#x591F;&#x52A0;&#x4EE5;&#x6A21;&#x578B;&#x7B80;&#x5316;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x8FD0;&#x7B97;&#x5F3A;&#x5EA6;&#x4F46;&#x53C8;&#x4E0D;&#x727A;&#x7272;&#x592A;&#x591A;&#x51C6;&#x786E;&#x6027;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x5C31;&#x66F4;&#x597D;&#x4E86;&#x3002;</li>
</ul>
<h4 id="CART&#x51B3;&#x7B56;&#x6811;&#x7B97;&#x6CD5;&#xFF08;&#x4F9D;&#x6B21;&#x5BF9;&#x5E94;C4-5&#x7684;&#x4E0D;&#x8DB3;&#xFF09;"><a href="#CART&#x51B3;&#x7B56;&#x6811;&#x7B97;&#x6CD5;&#xFF08;&#x4F9D;&#x6B21;&#x5BF9;&#x5E94;C4-5&#x7684;&#x4E0D;&#x8DB3;&#xFF09;" class="headerlink" title="CART&#x51B3;&#x7B56;&#x6811;&#x7B97;&#x6CD5;&#xFF08;&#x4F9D;&#x6B21;&#x5BF9;&#x5E94;C4.5&#x7684;&#x4E0D;&#x8DB3;&#xFF09;"></a>CART&#x51B3;&#x7B56;&#x6811;&#x7B97;&#x6CD5;&#xFF08;&#x4F9D;&#x6B21;&#x5BF9;&#x5E94;C4.5&#x7684;&#x4E0D;&#x8DB3;&#xFF09;</h4><p>CART&#x5206;&#x7C7B;&#x6811;&#x7B97;&#x6CD5;&#x4F7F;&#x7528;&#x57FA;&#x5C3C;&#x7CFB;&#x6570;&#x6765;&#x4EE3;&#x66FF;&#x4FE1;&#x606F;&#x589E;&#x76CA;&#x6BD4;&#xFF0C;&#x57FA;&#x5C3C;&#x7CFB;&#x6570;&#x4EE3;&#x8868;&#x4E86;&#x6A21;&#x578B;&#x7684;&#x4E0D;&#x7EAF;&#x5EA6;&#xFF0C;&#x57FA;&#x5C3C;&#x7CFB;&#x6570;&#x8D8A;&#x5C0F;&#xFF0C;&#x5219;&#x4E0D;&#x7EAF;&#x5EA6;&#x8D8A;&#x4F4E;&#xFF0C;&#x7279;&#x5F81;&#x8D8A;&#x597D;&#x3002;&#x8FD9;&#x548C;&#x4FE1;&#x606F;&#x589E;&#x76CA;(&#x6BD4;)&#x662F;&#x76F8;&#x53CD;&#x7684;&#x3002;</p>
<ul>
<li><p>CART&#x91C7;&#x7528;&#x7684;&#x529E;&#x6CD5;&#x662F;&#x540E;&#x526A;&#x679D;&#x6CD5;&#xFF0C;&#x5373;&#x5148;&#x751F;&#x6210;&#x51B3;&#x7B56;&#x6811;&#xFF0C;&#x7136;&#x540E;&#x4EA7;&#x751F;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x526A;&#x679D;&#x540E;&#x7684;CART&#x6811;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x6765;&#x68C0;&#x9A8C;&#x5404;&#x79CD;&#x526A;&#x679D;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x9009;&#x62E9;&#x6CDB;&#x5316;&#x80FD;&#x529B;&#x6700;&#x597D;&#x7684;&#x526A;&#x679D;&#x7B56;&#x7565;&#x3002;</p>
</li>
<li><p>&#x5BF9;&#x4E8E;CART&#x5206;&#x7C7B;&#x6811;&#x79BB;&#x6563;&#x503C;&#x7684;&#x5904;&#x7406;&#x95EE;&#x9898;&#xFF0C;&#x91C7;&#x7528;&#x7684;&#x601D;&#x8DEF;&#x662F;&#x4E0D;&#x505C;&#x7684;&#x4E8C;&#x5206;&#x79BB;&#x6563;&#x7279;&#x5F81;&#x3002;</p>
<blockquote>
<p>&#x5982;&#x679C;&#x67D0;&#x4E2A;&#x7279;&#x5F81;A&#x88AB;&#x9009;&#x53D6;&#x5EFA;&#x7ACB;&#x51B3;&#x7B56;&#x6811;&#x8282;&#x70B9;&#xFF0C;&#x5982;&#x679C;&#x5B83;&#x6709;A1,A2,A3&#x4E09;&#x79CD;&#x7C7B;&#x522B;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5728;&#x51B3;&#x7B56;&#x6811;&#x4E0A;&#x4E00;&#x4E0B;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x4E09;&#x53C9;&#x7684;&#x8282;&#x70B9;&#x3002;&#x8FD9;&#x6837;&#x5BFC;&#x81F4;&#x51B3;&#x7B56;&#x6811;&#x662F;&#x591A;&#x53C9;&#x6811;&#x3002;&#x4F46;&#x662F;CART&#x5206;&#x7C7B;&#x6811;&#x4F7F;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x4E0D;&#x540C;&#xFF0C;&#x4ED6;&#x91C7;&#x7528;&#x7684;&#x662F;&#x4E0D;&#x505C;&#x7684;&#x4E8C;&#x5206;&#xFF0C;&#x8FD8;&#x662F;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;CART&#x5206;&#x7C7B;&#x6811;&#x4F1A;&#x8003;&#x8651;&#x628A;A&#x5206;&#x6210;{A1}&#x548C;{A2,A3}&#xFF0C;{A2}&#x548C;{A1,A3}&#xFF0C;{A3}&#x548C;{A1,A2}&#x4E09;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x627E;&#x5230;&#x57FA;&#x5C3C;&#x7CFB;&#x6570;&#x6700;&#x5C0F;&#x7684;&#x7EC4;&#x5408;&#xFF0C;&#x6BD4;&#x5982;{A2}&#x548C;{A1,A3},&#x7136;&#x540E;&#x5EFA;&#x7ACB;&#x4E8C;&#x53C9;&#x6811;&#x8282;&#x70B9;&#xFF0C;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x662F;A2&#x5BF9;&#x5E94;&#x7684;&#x6837;&#x672C;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x662F;{A1,A3}&#x5BF9;&#x5E94;&#x7684;&#x8282;&#x70B9;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x7531;&#x4E8E;&#x8FD9;&#x6B21;&#x6CA1;&#x6709;&#x628A;&#x7279;&#x5F81;A&#x7684;&#x53D6;&#x503C;&#x5B8C;&#x5168;&#x5206;&#x5F00;&#xFF0C;&#x540E;&#x9762;&#x6211;&#x4EEC;&#x8FD8;&#x6709;&#x673A;&#x4F1A;&#x5728;&#x5B50;&#x8282;&#x70B9;&#x7EE7;&#x7EED;&#x9009;&#x62E9;&#x5230;&#x7279;&#x5F81;A&#x6765;&#x5212;&#x5206;A1&#x548C;A3&#x3002;</p>
</blockquote>
</li>
<li><p>CART&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x505A;&#x56DE;&#x5F52;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x505A;&#x5206;&#x7C7B;&#x3002;</p>
<blockquote>
<p>&#x5BF9;&#x4E8E;&#x8FDE;&#x7EED;&#x503C;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x6211;&#x4EEC;&#x77E5;&#x9053;CART&#x5206;&#x7C7B;&#x6811;&#x91C7;&#x7528;&#x7684;&#x662F;&#x7528;&#x57FA;&#x5C3C;&#x7CFB;&#x6570;&#x7684;&#x5927;&#x5C0F;&#x6765;&#x5EA6;&#x91CF;&#x7279;&#x5F81;&#x7684;&#x5404;&#x4E2A;&#x5212;&#x5206;&#x70B9;&#x7684;&#x4F18;&#x52A3;&#x60C5;&#x51B5;&#x3002;&#x8FD9;&#x6BD4;&#x8F83;&#x9002;&#x5408;&#x5206;&#x7C7B;&#x6A21;&#x578B;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E86;&#x5E38;&#x89C1;&#x7684;&#x5747;&#x65B9;&#x5DEE;&#x7684;&#x5EA6;&#x91CF;&#x65B9;&#x5F0F;&#xFF0C;CART&#x56DE;&#x5F52;&#x6811;&#x7684;&#x5EA6;&#x91CF;&#x76EE;&#x6807;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x4EFB;&#x610F;&#x5212;&#x5206;&#x7279;&#x5F81;A&#xFF0C;&#x5BF9;&#x5E94;&#x7684;&#x4EFB;&#x610F;&#x5212;&#x5206;&#x70B9;s&#x4E24;&#x8FB9;&#x5212;&#x5206;&#x6210;&#x7684;&#x6570;&#x636E;&#x96C6;D1&#x548C;D2&#xFF0C;&#x6C42;&#x51FA;&#x4F7F;D1&#x548C;D2&#x5404;&#x81EA;&#x96C6;&#x5408;&#x7684;&#x5747;&#x65B9;&#x5DEE;&#x6700;&#x5C0F;&#xFF0C;&#x540C;&#x65F6;D1&#x548C;D2&#x7684;&#x5747;&#x65B9;&#x5DEE;&#x4E4B;&#x548C;&#x6700;&#x5C0F;&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x7279;&#x5F81;&#x548C;&#x7279;&#x5F81;&#x503C;&#x5212;&#x5206;&#x70B9;&#x3002;<br>CART&#x5206;&#x7C7B;&#x6811;&#x91C7;&#x7528;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x91CC;&#x6982;&#x7387;&#x6700;&#x5927;&#x7684;&#x7C7B;&#x522B;&#x4F5C;&#x4E3A;&#x5F53;&#x524D;&#x8282;&#x70B9;&#x7684;&#x9884;&#x6D4B;&#x7C7B;&#x522B;&#x3002;&#x800C;&#x56DE;&#x5F52;&#x6811;&#x8F93;&#x51FA;&#x4E0D;&#x662F;&#x7C7B;&#x522B;&#xFF0C;&#x5B83;&#x91C7;&#x7528;&#x7684;&#x662F;&#x7528;&#x6700;&#x7EC8;&#x53F6;&#x5B50;&#x7684;&#x5747;&#x503C;&#x6216;&#x8005;&#x4E2D;&#x4F4D;&#x6570;&#x6765;&#x9884;&#x6D4B;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x3002;</p>
</blockquote>
</li>
<li><p>&#x71B5;&#x6A21;&#x578B;&#x7B80;&#x5316;&#x4E3A;&#x57FA;&#x5C3C;&#x6307;&#x6570;&#xFF0C;&#x5BF9;&#x4E8E;&#x6392;&#x5E8F;&#x540E;&#x9009;&#x7684;m-1&#x4E2A;&#x70B9;&#xFF0C;&#x5206;&#x522B;&#x8BA1;&#x7B97;&#x4EE5;&#x8BE5;&#x70B9;&#x4F5C;&#x4E3A;&#x4E8C;&#x5143;&#x5206;&#x7C7B;&#x70B9;&#x65F6;&#x7684;&#x57FA;&#x5C3C;&#x7CFB;&#x6570;&#x3002;&#x9009;&#x62E9;&#x57FA;&#x5C3C;&#x7CFB;&#x6570;&#x6700;&#x5C0F;&#x7684;&#x70B9;&#x4F5C;&#x4E3A;&#x8BE5;&#x8FDE;&#x7EED;&#x7279;&#x5F81;&#x7684;&#x4E8C;&#x5143;&#x79BB;&#x6563;&#x5206;&#x7C7B;&#x70B9;&#x3002;</p>
</li>
</ul>
<hr>
<h4 id="&#x57FA;&#x5C3C;&#x6307;&#x6570;&#x7684;&#x8BA1;&#x7B97;"><a href="#&#x57FA;&#x5C3C;&#x6307;&#x6570;&#x7684;&#x8BA1;&#x7B97;" class="headerlink" title="&#x57FA;&#x5C3C;&#x6307;&#x6570;&#x7684;&#x8BA1;&#x7B97;"></a>&#x57FA;&#x5C3C;&#x6307;&#x6570;&#x7684;&#x8BA1;&#x7B97;</h4><p>&#x516C;&#x5F0F;&#xFF1A;<br>&#x5206;&#x7C7B;&#x4E2D;&#x6709;k&#x4E2A;&#x7C7B;&#x522B;&#xFF0C;&#x7B2C;k&#x4E2A;&#x503C;&#x7684;&#x6982;&#x7387;&#x4E3A;pk&#xFF0C;&#x8BA1;&#x7B97;&#x57FA;&#x5C3C;&#x6307;&#x6570;&#xFF0C;&#x6BD4;&#x5982;&#x8F66;&#x578B;&#x5C5E;&#x6027;&#x4E2D;&#x7684;&#x5404;&#x7C7B;&#x578B;&#x7684;&#x57FA;&#x5C3C;&#x6307;&#x6570;&#x6216;&#x8005;&#x8BA1;&#x7B97;&#x6574;&#x4E2A;&#x6837;&#x672C;&#x7684;&#x57FA;&#x5C3C;&#x6307;&#x6570;&#x3002;<br><img src="/2020/04/05/%E5%86%B3%E7%AD%96%E6%A0%91/2.png" alt="bf6fc6c1930b9c255ba2772d143d6113.png"><br>&#x6BD4;&#x5982;&#x8BA1;&#x7B97;&#x8F66;&#x578B;&#x5C5E;&#x6027;&#xFF08;&#x7279;&#x5F81;&#xFF09;&#x7684;&#x6574;&#x4F53;&#x57FA;&#x5C3C;&#x6307;&#x6570;&#x503C;&#x3002;<br><img src="/2020/04/05/%E5%86%B3%E7%AD%96%E6%A0%91/3.png" alt="e4694305f5e7bca814b7ffb41cda8c68.png"><br>&#x4F8B;&#x5B50;&#xFF1A;<br><img src="/2020/04/05/%E5%86%B3%E7%AD%96%E6%A0%91/4.png" alt="54d847e8fad0fa84f75d04c04457fab6.png"><br>&#x6700;&#x540E;&#x9009;&#x62E9;&#x6700;&#x5C0F;&#x7684;&#x57FA;&#x5C3C;&#x6307;&#x6570;&#x7684;&#x5C5E;&#x6027;&#x3002;<br><a href="https://blog.csdn.net/wsp_1138886114/article/details/80955528" target="_blank" rel="noopener">&#x57FA;&#x5C3C;&#x6307;&#x6570;&#x5177;&#x4F53;&#x8BA1;&#x7B97;&#x4E60;&#x9898;</a></p>
<h4 id="&#x4FE1;&#x606F;&#x71B5;&#x7684;&#x8BA1;&#x7B97;"><a href="#&#x4FE1;&#x606F;&#x71B5;&#x7684;&#x8BA1;&#x7B97;" class="headerlink" title="&#x4FE1;&#x606F;&#x71B5;&#x7684;&#x8BA1;&#x7B97;"></a>&#x4FE1;&#x606F;&#x71B5;&#x7684;&#x8BA1;&#x7B97;</h4><p><img src="/2020/04/05/%E5%86%B3%E7%AD%96%E6%A0%91/5.png" alt="a45b39ec7f4b0f74408711b2cf09c3ba.png"><br>&#x67D0;&#x7279;&#x5F81;&#x7684;&#x71B5;&#x8BA1;&#x7B97;&#xFF1A;<br><img src="/2020/04/05/%E5%86%B3%E7%AD%96%E6%A0%91/6.png" alt="ca9028200391a2417ec90b91ac6a9a92.png"><br>&#x6240;&#x6709;&#x6837;&#x672C;&#x71B5;&#x8BA1;&#x7B97;&#xFF1A;<br><img src="/2020/04/05/%E5%86%B3%E7%AD%96%E6%A0%91/7.png" alt="28a54008ea92cb0ec2aa0fe9a7e6b3b1.png"><br>&#x6700;&#x540E;&#x9009;&#x62E9;&#x4FE1;&#x606F;&#x589E;&#x76CA;&#x6700;&#x5927;&#x7684;&#x5C5E;&#x6027;&#x3002;</p>

            <!--[if lt IE 9]><script>document.createElement('audio');</script><![endif]-->
            <audio id="audio" loop="1" preload="auto" controls="controls" data-autoplay="false">
                <source type="audio/mpeg" src="">
            </audio>
            
                <ul id="audio-list" style="display:none">
                    
                        
                            <li title='0' data-url='http://music.163.com/song/media/outer/url?id=1384026889.mp3'></li>
                        
                    
                        
                            <li title='1' data-url='http://music.163.com/song/media/outer/url?id=1341912654.mp3'></li>
                        
                    
                </ul>
            
        </div>
        
    <div id='gitalk-container' class="comment link"
		data-enable='true'
        data-ae='false'
        data-ci='7d6a5a19e87fc16b2000'
        data-cs='24053baf541ca1615e037a8b6f10e90728e944fd'
        data-r='windyxh.github.io'
        data-o='windyxh'
        data-a='windyxh'
        data-d='true'
    >查看评论</div>


    </div>
    
</div>


    </div>
</div>
</body>

<script src="//cdn.jsdelivr.net/npm/gitalk@1/dist/gitalk.min.js"></script>


<script src="//lib.baomitu.com/jquery/1.8.3/jquery.min.js"></script>
<script src="/js/plugin.js"></script>
<script src="/js/typed.js"></script>
<script src="/js/diaspora.js"></script>


<link rel="stylesheet" href="/photoswipe/photoswipe.css">
<link rel="stylesheet" href="/photoswipe/default-skin/default-skin.css">


<script src="/photoswipe/photoswipe.min.js"></script>
<script src="/photoswipe/photoswipe-ui-default.min.js"></script>


<!-- Root element of PhotoSwipe. Must have class pswp. -->
<div class="pswp" tabindex="-1" role="dialog" aria-hidden="true">
    <!-- Background of PhotoSwipe. 
         It's a separate element as animating opacity is faster than rgba(). -->
    <div class="pswp__bg"></div>
    <!-- Slides wrapper with overflow:hidden. -->
    <div class="pswp__scroll-wrap">
        <!-- Container that holds slides. 
            PhotoSwipe keeps only 3 of them in the DOM to save memory.
            Don't modify these 3 pswp__item elements, data is added later on. -->
        <div class="pswp__container">
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
        </div>
        <!-- Default (PhotoSwipeUI_Default) interface on top of sliding area. Can be changed. -->
        <div class="pswp__ui pswp__ui--hidden">
            <div class="pswp__top-bar">
                <!--  Controls are self-explanatory. Order can be changed. -->
                <div class="pswp__counter"></div>
                <button class="pswp__button pswp__button--close" title="Close (Esc)"></button>
                <button class="pswp__button pswp__button--share" title="Share"></button>
                <button class="pswp__button pswp__button--fs" title="Toggle fullscreen"></button>
                <button class="pswp__button pswp__button--zoom" title="Zoom in/out"></button>
                <!-- Preloader demo http://codepen.io/dimsemenov/pen/yyBWoR -->
                <!-- element will get class pswp__preloader--active when preloader is running -->
                <div class="pswp__preloader">
                    <div class="pswp__preloader__icn">
                      <div class="pswp__preloader__cut">
                        <div class="pswp__preloader__donut"></div>
                      </div>
                    </div>
                </div>
            </div>
            <div class="pswp__share-modal pswp__share-modal--hidden pswp__single-tap">
                <div class="pswp__share-tooltip"></div> 
            </div>
            <button class="pswp__button pswp__button--arrow--left" title="Previous (arrow left)">
            </button>
            <button class="pswp__button pswp__button--arrow--right" title="Next (arrow right)">
            </button>
            <div class="pswp__caption">
                <div class="pswp__caption__center"></div>
            </div>
        </div>
    </div>
</div>






</html>
